Repository: brian7704/OpenTAKServer-docs
Catalog: docs/locales/*/LC_MESSAGES/adsb.po
Languages: de

source: OpenTAKServer can pull live ADS-B data from the free [Airplanes.live](https://airplanes.live/) [API](https://airplanes.live/api-guide/). Aircraft will show on both your EUD's map and OpenTAKServer's map with 2525c icons.
de: OpenTAKServer kann live ADS-B Daten kostenlos von [Airplanes.live](https://airplanes.live/) [API](https://airplanes.live/api-guide/) beziehen. Die Flugzeuge werden auf dem Endgerät und der OpenTAKServer Karte mit 2525c Symbolen dargestellt.

source: Airplanes.live API Limits
de: Airplanes.live API Beschränkung

source: Airplanes.live limits their API to at most one request per second and a radius of 250nm.
de: Airplanes.live begrenzt seine API auf maximal eine Anfrage pro Sekunde und einen Radius von 250 Seemeilen.

source: Setting Location
de: Einstellort

source: You can change the location and radius to query in your `config.yml` file. The options are:
de: Sie können den Ort und den Radius der Abfrage in Ihrer `config.yml`-Datei ändern. Folgende Optionen stehen zur Verfügung:

source: `OTS_AIRPLANES_LIVE_LAT`: Latitude
de: `OTS_AIRPLANES_LIVE_LAT`: Breitengrad

source: `OTS_AIRPLANES_LIVE_LON`: Longitude
de: `OTS_AIRPLANES_LIVE_LON`: Längengrad

source: `OTS_AIRPLANES_LIVE_RADIUS`: In nautical miles and cannot be greater than 250
de: `OTS_AIRPLANES_LIVE_RADIUS`: In Seemeilen und darf nicht größer als 250 sein

source: Setting Query Frequency
de: Abfragehäufigkeit festlegen

source: While logged into the OTS web UI as an administrator, click on `Scheduled Jobs` in the navigation bar. Find the `Airplanes.live job` in the table and click the `Edit` button. Enter the desired amount of minutes and seconds to query the API and click the `Save` button.
de: Melden Sie sich als Administrator in der OTS-Weboberfläche an und klicken Sie in der Navigationsleiste auf `Geplante Jobs`. Suchen Sie in der Tabelle den Job `Airplanes.live` und klicken Sie auf die Schaltfläche `Bearbeiten`. Geben Sie die gewünschte Anzahl an Minuten und Sekunden für die API-Abfrage ein und klicken Sie auf die Schaltfläche `Speichern`.

source: Click on the `Activate` switch to enable the job.
de: Klicken Sie auf den Schalter `Aktivieren`, um den Auftrag zu aktivieren.
