Repository: brian7704/OpenTAKServer-docs
Catalog: docs/locales/*/LC_MESSAGES/API_old.po
Languages: de

source: Authentication
de: Authentifizierung

source: All API calls except for `/api/login` require [authentication](authentication.md). Some are restricted to administrators only.
de: Alle API-Aufrufe mit Ausnahme von `/api/login` erfordern eine [authentication](authentication.md). Einige sind ausschließlich Administratoren vorbehalten.

source: Pagination
de: Seitenzahlen

source: Most `GET` queries are paginated. You can include the `page` and `per_page` parameters to specify which page to get and how many results should be returned.
de: Die meisten `GET`-Abfragen sind paginiert. Sie können die Parameter `page` und `per_page` angeben, um festzulegen, welche Seite abgerufen werden soll und wie viele Ergebnisse zurückgegeben werden sollen.

source: Returns information about the server including disk usage, memory, usage, OS type and version, etc.
de: Gibt Informationen über den Server zurück, einschließlich Festplattennutzung, Speicherauslastung, Betriebssystemtyp und -version usw.

source: HTTP Method: `GET`
de: HTTP Methode: `GET`

source: Access: Everyone
de: Zugang: Für alle

source: Starts the TCP CoT streaming server.
de: Startet den TCP CoT Streaming-Server.

source: Access: Administrators only
de: Zugriff: Nur für Administratoren

source: Stops the TCP CoT streaming server.
de: Stoppt den TCP CoT-Streaming-Server.

source: Starts the SSL CoT streaming server
de: Startet den SSL CoT-Streaming-Server

source: Stops the TCP SSL streaming server
de: Stoppt den TCP/SSL-Streaming-Server

source: Downloads a certificate data package for the specified callsign
de: Lädt ein Zertifikatsdatenpaket für das angegebene Rufzeichen herunter

source: Parameters: callsign
de: Parameter: Rufzeichen

source: Creates a certificate data package for an EUD
de: Erstellt ein Zertifikatsdatenpaket für eine EUD

source: HTTP Method: `POST`
de: HTTP-Methode: `POST`

source: Content Type: `JSON`
de: Inhaltstyp: `JSON`

source: Content: `{'uid': 'Android-123456789', 'callsign': 'BRAVO'}`
de: Inhalt: `{'uid': 'Android-123456789', 'callsign': 'BRAVO'}`

source: Returns user account details
de: Gibt Details zum Benutzerkonto zurück

source: Uploads a data package
de: Lädt ein Datenpaket hoch

source: Deletes a data package
de: Löscht ein Datenpaket

source: HTTP Method: `DELETE`
de: HTTP-Methode: `DELETE`

source: Parameters: `hash` - The sha256 hash of the data package to delete
de: Parameter: `hash` – Der SHA256-Hash des zu löschenden Datenpakets

source: Returns info about data packages
de: Gibt Informationen über Datenpakete zurück

source: Parameters: The following parameters are all optional
de: Parameter: Die folgenden Parameter sind alle optional

source: `hash` - The sha256 hash of the data package
de: `hash` - Der SHA256-Hash des Datenpakets

source: `filename` - Data package filename.
de: `Dateiname` - Dateiname des Datenpakets.

source: `creator_uid`
de: `Ersteller_uid`

source: `keywords`
de: `Schlüsselwörter`

source: `size`
de: `Größe`

source: `tool`
de: `Werkzeug`

source: `page` - Which page to get
de: `page` - Welche Seite soll aufgerufen werden

source: `per_page` - Number of results per page
de: `per_page` - Anzahl der Ergebnisse pro Seite

source: Downloads a data package
de: Lädt ein Datenpaket herunter

source: Parameters: `hash` - The sha256 hash of the data package to download
de: Parameter: `hash` – Der SHA256-Hash des herunterzuladenden Datenpakets

source: Searches for CoTs stored in the database
de: Suche nach in der Datenbank gespeicherten CoTs

source: `how`
de: `wie`

source: `type`
de: `Typ`

source: `sender_callsign`
de: `Sender_Rufzeichen`

source: `page`
de: `Seite`

source: `per_page`
de: `pro_Seite`

source: Searches for alerts stored in the database
de: Sucht nach in der Datenbank gespeicherten Warnmeldungen

source: Parameters:
de: Parameter:

source: `alert_type`
de: `Warn_Typ`

source: Searches for points stored in the database
de: Sucht nach in der Datenbank gespeicherten Punkten

source: Parameters
de: Parameter

source: `uid` - UID of the EUD that created the point
de: `uid` - UID des EUD, der den Punkt erstellt hat

source: `callsign` - Callsign of the EUD that created the point
de: `Rufzeichen` - Rufzeichen des EUD, das den Punkt erstellt hat

source: Searches for CasEvacs that are stored in the database
de: Sucht nach CasEvacs, die in der Datenbank gespeichert sind

source: `sender_uid` - UID of the EUD that created the point
de: `sender_uid` - UID des EUD, der den Punkt erstellt hat

source: `uid` - UID of the CasEvac
de: `uid` - UID des CasEvac

source: Searches for markers stored in the database
de: Sucht nach in der Datenbank gespeicherten Markern

source: `uid` - The marker's unique ID
de: `uid` – Die eindeutige ID des Markers

source: `affiliation` - One of the following
de: `Zugehörigkeit` - Eine der folgenden

source: friendly
de: eigene

source: hostile
de: Feind

source: unknown
de: unbekannt

source: pending
de: ausstehend

source: assumed
de: vermutet

source: suspect
de: verdächtig

source: faker
de: Täuschung

source: `callsign` - The marker's callsign
de: `Rufzeichen` - Das Rufzeichen der Markierung

source: Adds a new marker or updates an existing one
de: Fügt eine neue Markierung hinzu oder aktualisiert eine bestehende

source: Content Type: JSON
de: Inhaltstyp: JSON

source: Required data in the JSON body
de: Erforderliche Daten im JSON-Body

source: `latitude` - float, must be >= -90 and <= 90
de: `latitude` - Gleitkommazahl, muss >= -90 und <= 90 sein

source: `longitude` - float, must be >= -180 and <= 180
de: `longitude` - Gleitkommazahl, muss >= -180 und <= 180 sein

source: `name` - name/callsign of the marker
de: `name` - Name/Rufzeichen des Markers

source: `uid` - An identifier in UUID4 format. If no marker exists with this UUID, a new on is created. Otherwise, the existing marker is updated.
de: `uid` – Eine Kennung im UUID4-Format. Existiert noch keine Markierung mit dieser UUID, wird eine neue erstellt. Andernfalls wird die vorhandene Markierung aktualisiert.

source: Optional data in the JSON body
de: Optionale Daten im JSON-Body

source: `type` - The CoT type, defaults to `a-u-G` if none is given. There are too many possible valid values to list but here are a few examples. See [this chart](https://www.spatialillusions.com/milsymbol/docs/milsymbol-2525c.html#heading-1) from milsymbol for more examples.
de: `type` – Der CoT-Typ, standardmäßig `a-u-G`, falls kein anderer angegeben ist. Es gibt zu viele mögliche gültige Werte, um sie hier aufzulisten; hier sind jedoch einige Beispiele. Weitere Beispiele finden Sie in [dieser Tabelle](https://www.spatialillusions.com/milsymbol/docs/milsymbol-2525c.html#heading-1) von milsymbol.

source: `a-f-G` - Affiliation friendly, battle dimension ground
de: `a-f-G` – Zugehörigkeitsfreundlich, Kampfdimensionsgelände

source: `a-h-U` - Affiliation hostile, battle dimension subsurface
de: `a-h-U` - Zugehörigkeit feindlich, Kampfdimension unterirdisch

source: `a-j-A` - Affiliation joker, battle dimension airborne
de: `a-j-A` – Zugehörigkeit: Joker, Kampfdimension: Luftlandetruppe

source: `course` - The direction of travel in compass degrees. Must be >= 0 and < 360. Defaults to 0.
de: `course` – Die Reiserichtung in Kompassgrad. Muss zwischen 0 und 360 liegen. Standardwert ist 0.

source: `azimuth` - The azimuth in compass degrees. Must be >= 0 and < 360. Defaults to 0.
de: `azimut` – Der Azimut in Kompassgrad. Muss zwischen 0 und 360 liegen. Standardwert ist 0.

source: `speed` - The speed in INSERT_UNIT_HERE. Must be >= 0. Defaults to 0.
de: `Geschwindigkeit` – Die Geschwindigkeit in INSERT_UNIT_HERE. Muss >= 0 sein. Standardwert ist 0.

source: `battery` - The remaining battery percentage. Must be >= 0 and <= 100. Defaults to NULL.
de: `battery` – Der verbleibende Akkustand in Prozent. Muss zwischen 0 und 100 % liegen. Standardwert ist NULL.

source: `fov` - The camera's field of vision in compass degrees. This will show a camera's view shed on the map.
de: `fov` – Das Sichtfeld der Kamera in Kompassgraden. Dies zeigt den Sichtbereich der Kamera auf der Karte an.

source: `ce` - Circular 1-sigma or a circular area about the location in meters
de: `ce` - Kreisförmige 1-Sigma- oder Kreisfläche um den Standort in Metern

source: `hae` - Height above the WGS ellipsoid in meters
de: `hae` - Höhe über dem WGS-Ellipsoid in Metern

source: `le` - Linear 1-sigma error or an altitude range about the location in meters
de: `le` - Linearer 1-Sigma-Fehler oder Höhenbereich um den Standort in Metern

source: Deletes a marker
de: Löscht eine Markierung

source: `uid` - The marker's UID
de: `uid` – Die UID des Markers

source: Searches for CasEvacs in the database
de: Sucht in der Datenbank nach CasEvacs

source: `callsign` - The CasEvac's Callsign
de: `Rufzeichen` - Das Rufzeichen von CasEvac

source: `uid` - The CasEvac's UID
de: `uid` – Die Benutzer-ID von CasEvac

source: Add or update a CasEvac
de: Fügen Sie einen CasEvac hinzu oder aktualisieren Sie ihn

source: HTTP Method `POST`
de: HTTP-Methode `POST`

source: Required data in JSON body
de: Erforderliche Daten im JSON-Body

source: `title` - Name of the CasEvac that will appear on the map
de: `title` - Name des CasEvac, der auf der Karte angezeigt wird

source: `ambulatory` - Integer
de: `ambulant` - Integer

source: `child` - Integer
de: `Kind` - Ganzzahl

source: `enemy` - Integer
de: `Feind` - Ganzzahl

source: `epw` - Integer
de: `epw` - Ganzzahl

source: `equipment_detail` - String
de: `Ausrüstung_detail` - String

source: `equipment_none` - Boolean
de: `Ausrüstung_keine` - Boolean

source: `equipment_other` - Boolean
de: `Ausrüstung_andere` - Boolean

source: `extration_equipment` - Boolean
de: `Extrations_Ausrüstung` - Boolean

source: `friendlies` - String
de: `verbündet` - String

source: `hlz_marking` - Integer
de: `hlz_Markierung` - Integer

source: `hoist` - Boolean
de: `Seilwinde` - Boolean

source: `litter` - Integer
de: `Trage` - Integer

source: `marked_by` - String
de: `markiert_von` - String

source: `nonus_civilian` - Integer
de: `nonus_zivil` - Integer

source: `nonus_military` - Integer
de: `nonus_Militär` - Integer

source: `obstacles` - String
de: `Hindernisse` - String

source: `priority` - Integer
de: `Priorität` - Integer

source: `terrain_loose` - Boolean
de: `Boden_lose` - Boolean

source: `terrain_other` - Boolean
de: `Boden_sonstige` - Boolean

source: `terrain_other_detail` - Boolean
de: `Boden_sonstiges_detail` - Boolean

source: `terrain_detail` - String
de: `Boden_detail` - String

source: `terrain_none` - Boolean
de: `Boden_kein` - Boolean

source: `terrain_rough` - Boolean
de: `Gelände_unwegsam` - Boolean

source: `terrain_slope` - Boolean
de: `Gelände_steil` - Boolean

source: `urgent` - Integer
de: `dringend` - Integer

source: `us_civilian` - Integer
de: `us_zivil` - Integer

source: `us_military` - Integer
de: `us_Militär` - Integer

source: `winds_are_from` - String
de: `wind_aus_Richtung` - String

source: `zone_prot_selection` - Integer
de: `Schutzzone_Auswahl` - Integer
