Repository: brian7704/OpenTAKServer-docs
Catalog: docs/locales/*/LC_MESSAGES/authentication.po
Languages: de, uk

source: Authentication
de: Authentifizierung
uk: Автентифікація

source: OpenTAKServer uses [Flask-Security](https://flask-security-too.readthedocs.io/en/stable/) to provide authentication.
de: OpenTAKServer verwendet [Flask-Security](https://flask-security-too.readthedocs.io/en/stable/) zur Authentifizierung.
uk: OpenTAKServer використовує [Flask-Security](https://flask-security-too.readthedocs.io/en/stable/) для забезпечення автентифікації.

source: Administrator Account
uk: Обліковий запис адміністратора

source: When you start OpenTAKServer for the first time, an administrator account is automatically created. The username is `administrator` and the password is `password`. You should immediately change the password when you first log in.
de: Beim ersten Start von OpenTAKServer wird automatisch ein Administratorkonto erstellt. Der Benutzername lautet `administrator` und das Passwort `password`. Sie sollten das Passwort unmittelbar nach der ersten Anmeldung ändern.
uk: Під час першого запуску OpenTAKServer автоматично створюється обліковий запис адміністратора. Ім'я користувача — `administrator`, а пароль — `password`. Вам слід негайно змінити пароль під час першого входу в систему.

source: Creating Accounts
de: Konten erstellen
uk: Створення облікових записів

source: By default, only administrators can create user accounts. However, users can register their own accounts if an administrator enables [email](email.md) support.
de: Standardmäßig können nur Administratoren Benutzerkonten erstellen. Benutzer können jedoch ihre eigenen Konten registrieren, wenn ein Administrator die E-Mail-Unterstützung [email](email.md) aktiviert.
uk: За замовчуванням лише адміністратори можуть створювати облікові записи користувачів. Однак користувачі можуть реєструвати власні облікові записи, якщо адміністратор увімкне підтримку [електронної пошти](email.md).

source: Note on Passwords
de: Hinweis zu Passwörtern
uk: Примітка щодо паролів

source: OpenTAKServer prevents `@` and `:` characters in passwords. In certain situations that use basic authentication, such as viewing RTSP streams, having these characters can cause an invalid URL. A typical URL when using basic authentication looks like `rtsp://username:password@server_address:8554/path`. In these situations, the ':' character separates the username and password, and the `@` character separates the username/password from the server address. Having a password with these characters will cause browsers and video players to incorrectly parse the URL.
de: OpenTAKServer verhindert die Zeichen `@` und `:` in Passwörtern. Bei der Verwendung der Basisauthentifizierung, beispielsweise beim Ansehen von RTSP-Streams, kann die Verwendung dieser Zeichen zu einer ungültigen URL führen. Eine typische URL bei Verwendung der Basisauthentifizierung sieht folgendermaßen aus: `rtsp://username:password@server_address:8554/path`. Hierbei trennt der Doppelpunkt (:) Benutzername und Passwort, und das Zeichen `@` trennt Benutzername/Passwort von der Serveradresse. Passwörter mit diesen Zeichen führen dazu, dass Browser und Videoplayer die URL falsch interpretieren.
uk: OpenTAKServer забороняє використання символів `@` та `:` у паролях. У певних ситуаціях, коли використовується базова автентифікація, наприклад, перегляд потоків RTSP, наявність цих символів може призвести до недійсної URL-адреси. Типова URL-адреса під час використання базової автентифікації виглядає так: `rtsp://ім'я користувача:пароль@адреса_сервера:8554/шлях`. У цих ситуаціях символ ':' розділяє ім'я користувача та пароль, а символ `@` розділяє ім'я користувача/пароль від адреси сервера. Наявність пароля з цими символами призведе до того, що браузери та відеоплеєри неправильно розбиратимуть URL-адресу.

source: Token Authentication
de: Token-Authentifizierung
uk: Автентифікація токенів

source: OpenTAKServer supports token authentication which can be helpful when interacting with OpenTAKServer via the [API](API_old). Use the following steps to authenticate with a token:
de: OpenTAKServer unterstützt die Token-Authentifizierung, die bei der Interaktion mit OpenTAKServer über die [API](API_old) hilfreich sein kann. Führen Sie die folgenden Schritte aus, um sich mit einem Token zu authentifizieren:
uk: OpenTAKServer підтримує автентифікацію за допомогою токенів, що може бути корисним під час взаємодії з OpenTAKServer через [API](API_old). Виконайте такі дії для автентифікації за допомогою токену:

source: Add these settings to `~/ots/config.yml` if they're not already present. This will remove the CSRF requirements for token auth but still require CSRF for basic and session auth.
de: Fügen Sie diese Einstellungen zu `~/ots/config.yml` hinzu, falls sie noch nicht vorhanden sind. Dadurch werden die CSRF-Anforderungen für die Token-Authentifizierung aufgehoben, CSRF ist jedoch weiterhin für die Basis- und Sitzungsauthentifizierung erforderlich.
uk: Додайте ці налаштування до `~/ots/config.yml`, якщо вони ще не присутні. Це видалить вимоги CSRF для автентифікації за токеном, але все ще вимагатиме CSRF для базової та сеансової автентифікації.

source: If you changed `config.yml` you must restart OpenTAKServer `sudo systemctl restart opentakserver`
de: Wenn Sie die Datei `config.yml` geändert haben, müssen Sie OpenTAKServer neu starten: `sudo systemctl restart opentakserver`
uk: Якщо ви змінили `config.yml`, вам потрібно перезапустити OpenTAKServer `sudo systemctl restart opentakserver`

source: Next, make an HTTP POST request to `/api/login` with the `include_auth_token` query parameter and your credentials as JSON. Here is an example in Python. If your server uses signed certs such as from Let's Encrypt you can remove `verify=False`.
de: Senden Sie anschließend eine HTTP-POST-Anfrage an `/api/login` mit dem Abfrageparameter `include_auth_token` und Ihren Anmeldeinformationen im JSON-Format. Hier ist ein Beispiel in Python. Wenn Ihr Server signierte Zertifikate verwendet, beispielsweise von Let's Encrypt, können Sie `verify=False` entfernen.
uk: Далі зробіть HTTP POST-запит до `/api/login` з параметром запиту `include_auth_token` та вашими обліковими даними у форматі JSON. Ось приклад на Python. Якщо ваш сервер використовує підписані сертифікати, такі як від Let's Encrypt, ви можете видалити `verify=False`.

source: A successful login JSON response will be as follows
de: Eine erfolgreiche Login-JSON-Antwort sieht wie folgt aus
uk: JSON-відповідь для успішного входу буде такою

source: The `authentication_token` must be sent on every subsequent request. It can be in a query parameter called `auth_token` or in an HTTP header called `Authentication-Token`
de: Das `Authentifizierungstoken` muss bei jeder nachfolgenden Anfrage gesendet werden. Es kann in einem Abfrageparameter namens `auth_token` oder in einem HTTP-Header namens `Authentication-Token` enthalten sein
uk: `authentication_token` має надсилатися з кожним наступним запитом. Він може бути в параметрі запиту під назвою `auth_token` або в HTTP-заголовку під назвою `Authentication-Token`

source: Session Authentication
de: Sitzungsauthentifizierung
uk: Автентифікація сеансу

source: Making API calls while using session authentication requires a CSRF token. Here is a python example using session authentication. If your server uses signed certs such as from Let's Encrypt you can remove `verify=False`.
de: Für API-Aufrufe mit Sitzungsauthentifizierung ist ein CSRF-Token erforderlich. Hier ist ein Python-Beispiel mit Sitzungsauthentifizierung. Wenn Ihr Server signierte Zertifikate wie beispielsweise von Let's Encrypt verwendet, können Sie `verify=False` entfernen.
uk: Для здійснення викликів API під час використання автентифікації сеансу потрібен токен CSRF. Ось приклад Python з використанням автентифікації сеансу. Якщо ваш сервер використовує підписані сертифікати, такі як від Let's Encrypt, ви можете видалити `verify=False`.

source: Whitelisting and Blacklisting Email Domains
de: Whitelisting und Blacklisting von E-Mail-Domains
uk: Внесення доменів електронної пошти до білого та чорного списків

source: If email support is enabled, any valid email address can be used to create an account. However, there are whitelists for email domains and top level domains. Likewise, there are also blacklists. For example, if you add `example.com` to the `OTS_EMAIL_DOMAIN_WHITELIST` option, only users with `@example.com` email addresses can register accounts. You can also add top level domains (TLDs) to the `OTS_EMAIL_TLD_WHITELIST` option. For example, adding `gov` and `mil` will allow only users with .gov or .mil email accounts to register accounts.
de: Wenn die E-Mail-Unterstützung aktiviert ist, kann jede gültige E-Mail-Adresse zur Kontoerstellung verwendet werden. Es gibt jedoch Whitelists für E-Mail-Domains und Top-Level-Domains (TLDs). Ebenso existieren Blacklists. Wenn Sie beispielsweise `example.com` zur Option `OTS_EMAIL_DOMAIN_WHITELIST` hinzufügen, können sich nur Nutzer mit E-Mail-Adressen der Endung `@example.com` registrieren. Sie können auch Top-Level-Domains (TLDs) zur Option `OTS_EMAIL_TLD_WHITELIST` hinzufügen. Wenn Sie beispielsweise `gov` und `mil` hinzufügen, können sich nur Nutzer mit .gov- oder .mil-E-Mail-Konten registrieren.
uk: Якщо ввімкнено підтримку електронної пошти, для створення облікового запису можна використовувати будь-яку дійсну адресу електронної пошти. Однак існують білі списки для доменів електронної пошти та доменів верхнього рівня. Так само є й чорні списки. Наприклад, якщо додати `example.com` до опції `OTS_EMAIL_DOMAIN_WHITELIST`, облікові записи зможуть зареєструвати лише користувачі з адресами електронної пошти `@example.com`. Ви також можете додати домени верхнього рівня (TLD) до опції `OTS_EMAIL_TLD_WHITELIST`. Наприклад, додавання `gov` та `mil` дозволить зареєструвати облікові записи лише користувачам з обліковими записами електронної пошти .gov або .mil.

source: `OTS_EMAIL_DOMAIN_BLACKLIST` and `OTS_EMAIL_TLD_BLACKLIST` are similar except that any email address not in those lists will be able to register for an account.
de: `OTS_EMAIL_DOMAIN_BLACKLIST` und `OTS_EMAIL_TLD_BLACKLIST` sind ähnlich, mit der Ausnahme, dass sich jede E-Mail-Adresse, die nicht auf diesen Listen steht, für ein Konto registrieren kann.
uk: `OTS_EMAIL_DOMAIN_BLACKLIST` та `OTS_EMAIL_TLD_BLACKLIST` схожі, за винятком того, що будь-яка адреса електронної пошти, яка не входить до цих списків, зможе зареєструвати обліковий запис.

source: Two-Factor Authentication
de: Zwei-Faktor-Authentifizierung
uk: Двофакторна автентифікація

source: TOTP
uk: ТОТП

source: Two-factor authentication can be enabled for any accounts using a TOTP from an authenticator app such as Google Authenticator ([Android](https://play.google.com/store/apps/details?id=com.google.android.apps.authenticator2&hl=en_US&gl=US)/[iOS](https://apps.apple.com/us/app/google-authenticator/id388497605)) or Microsoft Authenticator ([Android](https://play.google.com/store/apps/details?id=com.azure.authenticator)/[iOS](https://apps.apple.com/us/app/microsoft-authenticator/id983156458)). Click on `Setup 2FA` in the navigation bar and select the authenticator app option. It will generate a code and a QR code. Either scan the QR code with your authenticator app or copy and paste the code into the authenticator app. Your authenticator app will give you a PIN that you enter below the QR code.
de: Die Zwei-Faktor-Authentifizierung (2FA) kann für jedes Konto mithilfe eines TOTP-Codes einer Authentifizierungs-App wie Google Authenticator ([Android](https://play.google.com/store/apps/details?id=com.google.android.apps.authenticator2&hl=en_US&gl=US)/[iOS](https://apps.apple.com/us/app/google-authenticator/id388497605)) oder Microsoft Authenticator ([Android](https://play.google.com/store/apps/details?id=com.azure.authenticator)/[iOS](https://apps.apple.com/us/app/microsoft-authenticator/id983156458)) aktiviert werden. Klicken Sie in der Navigationsleiste auf `2FA einrichten` und wählen Sie die Option für die Authentifizierungs-App aus. Es werden ein Code und ein QR-Code generiert. Scannen Sie entweder den QR-Code mit Ihrer Authentifizierungs-App oder kopieren Sie ihn in die App und fügen Sie ihn dort ein. Ihre Authentifizierungs-App generiert dann eine PIN, die Sie unterhalb des QR-Codes eingeben.
uk: Двофакторну автентифікацію можна ввімкнути для будь-яких облікових записів, що використовують TOTP, з програми-автентифікатора, такої як Google Authenticator ([Android](https://play.google.com/store/apps/details?id=com.google.android.apps.authenticator2&hl=en_US&gl=US)/[iOS](https://apps.apple.com/us/app/google-authenticator/id388497605)) або Microsoft Authenticator ([Android](https://play.google.com/store/apps/details?id=com.azure.authenticator)/[iOS](https://apps.apple.com/us/app/microsoft-authenticator/id983156458)). Натисніть `Налаштування 2FA` на панелі навігації та виберіть опцію програми-автентифікатора. Вона згенерує код та QR-код. Або відскануйте QR-код за допомогою програми автентифікації, або скопіюйте та вставте код у програму автентифікації. Ваша програма автентифікації надасть вам PIN-код, який потрібно ввести під QR-кодом.

source: Email
uk: Електронна пошта

source: You can choose to use an email address as your 2FA if your administrator has [enabled](email.md) email support. A code will be sent to your email address which you will need to enter when you log in.
de: Sie können Ihre E-Mail-Adresse als Zwei-Faktor-Authentifizierung (2FA) verwenden, sofern Ihr Administrator E-Mail-Unterstützung [enabled](email.md) aktiviert hat. Sie erhalten dann einen Code per E-Mail, den Sie beim Anmelden eingeben müssen.
uk: Ви можете використовувати адресу електронної пошти як двофакторну аутентифікацію (2FA), якщо ваш адміністратор [увімкнув](email.md) підтримку електронної пошти. На вашу адресу електронної пошти буде надіслано код, який потрібно буде ввести під час входу.

source: Screenshot
uk: Знімок екрана

source: ![!2FA Setup](images/2fa_setup.png)
de: ![!2FA-Einrichtung](images/2fa_setup.png)
uk: ![!Налаштування 2FA](images/2fa_setup.png)

source: SSL Socket Authentication
de: SSL-Socket-Authentifizierung
uk: Автентифікація сокетів SSL

source: Connecting to OpenTAKServer's SSL socket requires authentication. In ATAK's server setup, tap `Use Authentication` and enter your username and password. When ATAK connects, it will send an `<auth>` CoT with the username and password. If the username and password are incorrect, the account is disabled, or no `<auth>` CoT is sent, OpenTAKServer will close the connection. Two-Factor authentication is not required for the SSL socket.
de: Für die Verbindung zum SSL-Socket von OpenTAKServer ist eine Authentifizierung erforderlich. Tippen Sie in den Servereinstellungen von ATAK auf `Authentifizierung verwenden` und geben Sie Ihren Benutzernamen und Ihr Passwort ein. Nach erfolgreicher Verbindung sendet ATAK eine `<auth>` CoT mit Benutzername und Passwort. Sind Benutzername und Passwort falsch, das Konto deaktiviert oder wird keine `<auth>` CoT gesendet, schließt OpenTAKServer die Verbindung. Eine Zwei-Faktor-Authentifizierung ist für den SSL-Socket nicht erforderlich.
uk: Підключення до SSL-сокета OpenTAKServer вимагає автентифікації. У налаштуваннях сервера ATAK натисніть `Використовувати автентифікацію` та введіть своє ім'я користувача та пароль. Коли ATAK підключиться, він надішле `<auth>` CoT з іменем користувача та паролем. Якщо ім'я користувача та пароль неправильні, обліковий запис вимкнено або `<auth>` CoT не надіслано, OpenTAKServer закриє з'єднання. Двофакторна автентифікація не потрібна для SSL-сокета.

source: !2FA Setup
de: !2FA-Einrichtung
