Repository: brian7704/OpenTAKServer-docs
Catalog: docs/locales/*/LC_MESSAGES/certificate_enrollment.po
Languages: de, uk

source: Certificate Enrollment
de: Zertifikatverteilung
uk: Реєстрація сертифіката

source: OpenTAKServer supports client certificate enrollment which defaults to port `8446`.
de: OpenTAKServer unterstützt Client Zertifikat Enrollment über den default port `8446`.
uk: OpenTAKServer підтримує реєстрацію клієнтських сертифікатів, для яких за замовчуванням використовується порт `8446`.

source: Authentication
de: Authentifizierung
uk: Автентифікація

source: Certificate enrollment requires authentication. You will need to register an account on your OpenTAKServer or have an administrator make an account for you.
de: Die Zertifikatseinschreibung erfordert eine Authentifizierung. Sie müssen ein Konto auf Ihrem OpenTAKServer registrieren oder sich von einem Administrator ein Konto anlegen lassen.
uk: Реєстрація сертифіката вимагає автентифікації. Вам потрібно буде зареєструвати обліковий запис на вашому OpenTAKServer або попросити адміністратора створити обліковий запис для вас.

source: Prerequisites
de: Voraussetzungen
uk: Передумови

source: The default port for certificate enrollment is `8446`. This port will use one of two types of certificates, self-signed or Let's Encrypt. The default is to use self-signed certificates. If your server uses self-signed certificates, you will need a copy of your server's truststore certificate for auto-enrollment. You can download a copy at `https://your_server_address/api/truststore` or by logging into the web UI and clicking the `Download Truststore` button.
de: Der Standardport für die Zertifikatsregistrierung ist 8446. Über diesen Port werden entweder selbstsignierte Zertifikate oder Let's Encrypt-Zertifikate verwendet. Standardmäßig werden selbstsignierte Zertifikate verwendet. Wenn Ihr Server selbstsignierte Zertifikate nutzt, benötigen Sie für die automatische Registrierung eine Kopie des Truststore-Zertifikats Ihres Servers. Sie können diese unter `https://your_server_address/api/truststore` herunterladen oder indem Sie sich in der Web-Oberfläche anmelden und auf die Schaltfläche `Download Truststore` klicken.
uk: Порт за замовчуванням для реєстрації сертифікатів – `8446`. Цей порт використовуватиме один із двох типів сертифікатів: самопідписані або Let's Encrypt. За замовчуванням використовуються самопідписані сертифікати. Якщо ваш сервер використовує самопідписані сертифікати, вам знадобиться копія сертифіката сховища довірених сертифікатів вашого сервера для автоматичної реєстрації. Ви можете завантажити копію за адресою `https://your_server_address/api/truststore` або увійшовши у веб-інтерфейс і натиснувши кнопку `Завантажити сховище довірених сертифікатів`.

source: In order to use a QR code for iTAK enrollment, your server must be configured with a signed certificate from Let's Encrypt or a similar trusted certificate authority.
de: Um einen QR-Code für die iTAK-Registrierung verwenden zu können, muss Ihr Server mit einem signierten Zertifikat von Let's Encrypt oder einer ähnlichen vertrauenswürdigen Zertifizierungsstelle konfiguriert sein.
uk: Щоб використовувати QR-код для реєстрації iTAK, ваш сервер має бути налаштований за допомогою підписаного сертифіката від Let's Encrypt або аналогічного довіреного центру сертифікації.

source: Starting in version 1.5.0, OpenTAKServer supports QR code generation for ATAK certificate registration. This feature requires that your server has a domain name with a trusted cert from Let's Encrypt or a similar trusted certificate authority. When generating a QR code, you can optionally specify an expiration date and a maximum number of uses. If either or both are specified, the QR code will no longer work after the expiration date or the maximum number of uses (whichever comes first). The QR code can also be deleted. If it's scanned after being deleted, certificate registration will fail.
de: Ab Version 1.5.0 unterstützt OpenTAKServer die Generierung von QR-Codes für die ATAK-Zertifikatsregistrierung. Diese Funktion setzt voraus, dass Ihr Server über einen Domainnamen mit einem vertrauenswürdigen Zertifikat von Let's Encrypt oder einer vergleichbaren Zertifizierungsstelle verfügt. Beim Generieren eines QR-Codes können Sie optional ein Ablaufdatum und eine maximale Anzahl an Nutzungen festlegen. Sind eines oder beides angegeben, ist der QR-Code nach Ablauf des Gültigkeitsdatums oder Erreichen der maximalen Anzahl an Nutzungen (je nachdem, was zuerst eintritt) nicht mehr gültig. Der QR-Code kann auch gelöscht werden. Wird er nach dem Löschen gescannt, schlägt die Zertifikatsregistrierung fehl.
uk: Починаючи з версії 1.5.0, OpenTAKServer підтримує генерацію QR-кодів для реєстрації сертифіката ATAK. Ця функція вимагає, щоб ваш сервер мав доменне ім'я з довіреним сертифікатом від Let's Encrypt або подібного довіреного центру сертифікації. Під час генерації QR-коду ви можете за потреби вказати термін дії та максимальну кількість використань. Якщо вказано один або обидва варіанти, QR-код більше не працюватиме після закінчення терміну дії або максимальної кількості використань (залежно від того, що настане раніше). QR-код також можна видалити. Якщо його просканувати після видалення, реєстрація сертифіката не вдасться.

source: Each user can only have one active QR code at a time but the code can be deleted and regenerated at any time. The QR code is unique to the user that generated it and should be treated like a password in most cases. However, it is possible to generate a single QR code and let multiple users scan it.
de: Jeder Benutzer kann jeweils nur einen aktiven QR-Code besitzen. Dieser kann jedoch jederzeit gelöscht und neu generiert werden. Der QR-Code ist benutzerspezifisch und sollte in den meisten Fällen wie ein Passwort behandelt werden. Es ist jedoch möglich, einen einzigen QR-Code zu generieren, den mehrere Benutzer scannen können.
uk: Кожен користувач може мати лише один активний QR-код одночасно, але його можна видалити та створити повторно в будь-який час. QR-код унікальний для користувача, який його створив, і в більшості випадків його слід розглядати як пароль. Однак можна створити один QR-код і дозволити кільком користувачам сканувати його.

source: To scan the QR code, use your EUD's camera app or any QR code scanning app. Once scanned, opening the link will automatically open ATAK and start the certificate registration process. This method does not require the user to uncheck the Preconfigured Trust option.
de: Scannen Sie den QR-Code mit der Kamera-App Ihres Endgeräts oder einer beliebigen QR-Code-Scanner-App. Nach dem Scannen öffnet sich ATAK automatisch und der Zertifikatsregistrierungsprozess startet. Bei dieser Methode muss die Option „Vorkonfiguriertes Vertrauen“ nicht deaktiviert werden.
uk: Щоб відсканувати QR-код, скористайтеся застосунком камери вашого EUD або будь-яким іншим застосунком для сканування QR-кодів. Після сканування відкриття посилання автоматично відкриє ATAK та розпочне процес реєстрації сертифіката. Цей метод не вимагає від користувача знімати прапорець біля опції «Попередньо налаштована довіра».

source: Alternatively, if you are logged into the web UI on your EUD you can tap the `Open ATAK` button instead of scanning the QR code to start the certificate registration process.
de: Alternativ können Sie, wenn Sie in der Web-Benutzeroberfläche Ihres EUD angemeldet sind, auf die Schaltfläche `ATAK öffnen` tippen, anstatt den QR-Code zu scannen, um den Zertifikatsregistrierungsprozess zu starten.
uk: Або ж, якщо ви ввійшли у веб-інтерфейс на вашому EUD, ви можете натиснути кнопку `Відкрити ATAK` замість сканування QR-коду, щоб розпочати процес реєстрації сертифіката.

source: Instructions
de: Anweisungen
uk: Інструкції

source: On the main ATAK screen, tap the hamburger icon in the top right corner and tap `Settings`
de: Tippen Sie auf dem Hauptbildschirm von ATAK auf das Hamburger-Symbol in der oberen rechten Ecke und tippen Sie auf `Einstellungen`
uk: На головному екрані ATAK торкніться значка гамбургера у верхньому правому куті та виберіть `Налаштування`

source: Tap on `Network Preferences`
de: Tippen Sie auf `Netzwerkeinstellungen`
uk: Натисніть на `Налаштування мережі `

source: Tap on `TAK Servers`
de: Tippe auf `TAK Server`
uk: Натисніть на ` Сервери TAK `

source: Tap the three vertical dots button in the top right corner and tap `Add`
de: Tippe auf die Schaltfläche mit den drei vertikalen Punkten in der oberen rechten Ecke und tippe dann auf `Hinzufügen`
uk: Натисніть кнопку з трьома вертикальними крапками у верхньому правому куті та натисніть `Додати`

source: Fill out your server's name and address
de: Geben Sie den Namen und die Adresse Ihres Servers ein
uk: Введіть назву та адресу вашого сервера

source: Check the `Use Authentication` checkbox and enter your OpenTAKServer username and password
de: Aktivieren Sie das Kontrollkästchen `Authentifizierung verwenden` und geben Sie Ihren OpenTAKServer-Benutzernamen und Ihr Passwort ein
uk: Поставте прапорець `Використовувати автентифікацію` та введіть своє ім’я користувача та пароль OpenTAKServer

source: Check the `Enroll for Client Certificate` checkbox
de: Aktivieren Sie das Kontrollkästchen `Für Clientzertifikat registrieren`
uk: Поставте прапорець `Зареєструвати сертифікат клієнта`

source: Make sure Streaming Protocol is set to `SSL`
de: Stellen Sie sicher, dass das Streaming-Protokoll auf `SSL` eingestellt ist
uk: Переконайтеся, що для протоколу потокової передачі встановлено значення `SSL`

source: The default server port is `8089` unless OpenTAKServer has been configured to use a different port. Ask your server's admin if you are unsure
de: Der Standard-Serverport ist `8089`, sofern OpenTAKServer nicht für die Verwendung eines anderen Ports konfiguriert wurde. Fragen Sie im Zweifelsfall Ihren Serveradministrator
uk: Порт сервера за замовчуванням — `8089`, якщо OpenTAKServer не налаштовано на використання іншого порту. Якщо ви не впевнені, зверніться до адміністратора вашого сервера

source: Use default SSL/TLS Certificates
de: Standard-SSL/TLS-Zertifikate verwenden
uk: Використовувати стандартні SSL/TLS-сертифікати

source: Self-signed certificates (This is the most common setup)
de: Selbstsignierte Zertifikate (Dies ist die gängigste Konfiguration)
uk: Самопідписані сертифікати (це найпоширеніша конфігурація)

source: If your OpenTAKServer is using self-signed certificates, uncheck `Use default SSL/TLS Certificates`
de: Wenn Ihr OpenTAKServer selbstsignierte Zertifikate verwendet, deaktivieren Sie `Standard-SSL/TLS-Zertifikate verwenden`
uk: Якщо ваш OpenTAKServer використовує самопідписані сертифікати, зніміть позначку з `Використовувати сертифікати SSL/TLS за замовчуванням `

source: Make sure that `Enroll with Preconfigured Trust` **IS** checked (you may not have this option if you're on an older version of ATAK)
de: Stellen Sie sicher, dass `Mit vorkonfigurierter Vertrauensstellung registrieren` **IS** aktiviert ist (diese Option ist möglicherweise nicht verfügbar, wenn Sie eine ältere Version von ATAK verwenden)
uk: Переконайтеся, що позначено опцію `Зареєструватися з попередньо налаштованим довірчим керуванням` **Є** (ця опція може бути недоступна, якщо ви використовуєте старішу версію ATAK)

source: Tap the Import Trust Store button and find your trust store file.
de: Tippen Sie auf die Schaltfläche „Truststore importieren“ und suchen Sie Ihre Truststore-Datei.
uk: Натисніть кнопку «Імпортувати сховище довірених сертифікатів» і знайдіть файл свого сховища довірених сертифікатів.

source: In the password field next to that button, type your trust store certificate's password. The default is `atakatak`
de: Geben Sie im Passwortfeld neben dieser Schaltfläche das Passwort Ihres Truststore-Zertifikats ein. Der Standardwert lautet `atakatak`
uk: У полі пароля поруч із цією кнопкою введіть пароль сертифіката вашого сховища довірених сертифікатів. Пароль за замовчуванням — `atakatak`

source: Tap OK
de: Tippen Sie auf OK
uk: Натисніть OK

source: Let's Encrypt Certificates
de: Let's Encrypt-Zertifikate

source: Leave `Use default SSL/TLS Certificates` checked
de: Die Option `Standard-SSL/TLS-Zertifikate verwenden` sollte aktiviert bleiben

source: Make sure that `Enroll with Preconfigured Trust` **IS NOT** checked (you may not have this option if you're on an older version of ATAK)
de: Stellen Sie sicher, dass `Mit vorkonfigurierter Vertrauensstellung registrieren` ** NICHT** aktiviert ist (diese Option ist möglicherweise nicht verfügbar, wenn Sie eine ältere Version von ATAK verwenden)

source: Tap the `Ok` button at the bottom of the screen
de: Tippen Sie unten auf dem Bildschirm auf die Schaltfläche `Ok`

source: After a few seconds you should see a message that registration has succeeded, and you will be automatically connected to the server
de: Nach wenigen Sekunden sollte eine Meldung erscheinen, dass die Registrierung erfolgreich war, und Sie werden automatisch mit dem Server verbunden

source: Any data packages, plugins, and device profiles that have been set by the server admin to install on enrollment will be automatically installed
de: Alle Datenpakete, Plugins und Geräteprofile, die vom Serveradministrator zur Installation bei der Registrierung festgelegt wurden, werden automatisch installiert

source: Settings
de: Einstellungen

source: Self-Signed Certificate Settings
de: Einstellungen für selbstsignierte Zertifikate

source: Self-Signed Certificate Screenshot
de: Screenshot des selbstsignierten Zertifikats

source: Let's Encrypt Settings
de: Let's Encrypt-Einstellungen

source: iTAK QR Code
uk: QR-код iTAK

source: ATAK QR Code
uk: QR-код ATAK

source: !ATAK QR Code
uk: QR-код ATAK
