Repository: brian7704/OpenTAKServer-docs
Catalog: docs/locales/*/LC_MESSAGES/cloudtak.po
Languages: de

source: OpenTAKServer is compatible with [CloudTAK](https://github.com/dfpc-coe/CloudTAK), a fully featured, in-browser TAK client.
de: OpenTAKServer ist mit [CloudTAK](https://github.com/dfpc-coe/CloudTAK), einem vollwertigen in-browser Tak client kompatibel.

source: Notes
de: Notizen

source: CloudTAK has only been tested using an FQDN with a trusted certificate (i.e. Let's Encrypt). It may still work without an FQDN or trusted cert, but SSL is always required. For best results you should create a subdomain. For example, if your FQDN is `example.com`, your subdomain could be `cloudtak.example.com`.
de: CloudTAK wurde bisher nur mit einem FQDN und einem vertrauenswürdigen Zertifikat (z. B. Let’s Encrypt) getestet. Es kann zwar auch ohne FQDN oder vertrauenswürdiges Zertifikat funktionieren, SSL ist jedoch immer erforderlich. Für beste Ergebnisse sollten Sie eine Subdomain erstellen. Wenn Ihr FQDN beispielsweise `example.com` ist, könnte Ihre Subdomain `cloudtak.example.com` sein.

source: If you need support, please ask in the OTS discord rather than contacting COTAK (the creators of CloudTAK).
de: Wenn Sie Unterstützung benötigen, wenden Sie sich bitte an den OTS-Discord und nicht an COTAK (die Entwickler von CloudTAK).

source: This guide assume that you're installing CloudTAK on the same server as OpenTAKServer.
de: Diese Anleitung setzt voraus, dass Sie CloudTAK auf demselben Server wie OpenTAKServer installieren.

source: Run these commands to install Docker on Ubuntu. If you're not using Ubuntu, check the Docker docs on how to install for your distro.
de: Führen Sie diese Befehle aus, um Docker unter Ubuntu zu installieren. Wenn Sie nicht Ubuntu verwenden, lesen Sie in der Docker-Dokumentation nach, wie Sie Docker für Ihre Distribution installieren.

source: Clone the CloudTAK repo
de: Klonen Sie das CloudTAK-Repository

source: Change `API_URL` in docker_compose.yml. It should be prefixed with `https://` and should be changed to the IP or FQDN that you'll use to access it. You should also remove `:5000` at the end. It cannot be localhost unless you're installing CloudTAK to the same computer you'll be accessing it from.
de: Ändern Sie `API_URL` in docker_compose.yml. Es sollte mit `https://` beginnen und durch die IP-Adresse oder den FQDN ersetzt werden, über den Sie darauf zugreifen. Entfernen Sie außerdem `:5000` am Ende. „localhost“ ist nur zulässig, wenn Sie CloudTAK auf demselben Computer installieren, von dem aus Sie darauf zugreifen.

source: Configure the nginx proxy. Copy the config below and paste it to a new file at `/etc/nginx/sites-available/cloudtak`. You also need to change the `server_name` line to your FQDN.
de: Konfigurieren Sie den Nginx-Proxy. Kopieren Sie die unten stehende Konfiguration und fügen Sie sie in eine neue Datei unter `/etc/nginx/sites-available/cloudtak` ein. Ersetzen Sie außerdem in der Zeile `server_name` Ihren FQDN.

source: Create a symbolic link to enable the new nginx config file.
de: Erstellen Sie einen symbolischen Link, um die neue nginx-Konfigurationsdatei zu aktivieren.

source: Edit `/etc/nginx/sites-available/ots_certificate_enrollment` and add the following inside the `server {}` stanza.
de: Bearbeiten Sie `/etc/nginx/sites-available/ots_certificate_enrollment` und fügen Sie Folgendes innerhalb des `server {}`-Abschnitts hinzu.

source: Edit `/etc/nginx/sites-available/ots_https` and add this inside the listen 8443 `server {}`.
de: Bearbeiten Sie `/etc/nginx/sites-available/ots_https` und fügen Sie dies innerhalb von listen 8443 `server {}` hinzu.

source: Install certbot and nginx `sudo apt install nginx certbot python3-certbot-nginx -y`
de: Installieren Sie certbot und nginx `sudo apt install nginx certbot python3-certbot-nginx -y`

source: Get a cert from Let's Encrypt `sudo certbot --nginx`
de: Holen Sie sich ein Zertifikat von Let's Encrypt `sudo certbot --nginx`

source: Restart nginx `sudo systemctl restart nginx`
de: nginx neu starten `sudo systemctl restart nginx`

source: Open a browser and enter your CloudTAK server's URL, i.e. https://cloudtak.example.com
de: Öffnen Sie einen Browser und geben Sie die URL Ihres CloudTAK-Servers ein, z. B. https://cloudtak.example.com
