Repository: brian7704/OpenTAKServer-docs
Catalog: docs/locales/*/LC_MESSAGES/data_packages.po
Languages: uk

source: Data Packages
uk: Пакети даних

source: Uploading Data Packages Zip files
uk: Завантаження пакетів даних у ZIP-архіви

source: Data package zip files can be uploaded via OpenTAKServer's web UI. When they are uploaded, EUDs can download them via the data package tool.
uk: ZIP-файли пакетів даних можна завантажити через веб-інтерфейс OpenTAKServer. Після завантаження EUD можуть завантажити їх за допомогою інструмента для роботи з пакетами даних.

source: Sending Data Packages from EUDs
uk: Надсилання пакетів даних з EUD

source: OpenTAKServer will automatically store a copy of and data package sent out by EUDs.
uk: OpenTAKServer автоматично зберігатиме копію пакета даних, надісланого EUD.

source: Automatic Data Package Creation
uk: Автоматичне створення пакетів даних

source: `png`, `jpg`, `jpeg`, and `xml` files can also be uploaded on the Data Packages page in the web UI. When they're uploaded, OpenTAKServer will automatically create data package zip files for them. If an image has GPS coordinates set in its EXIF data, it will automatically show on the EUD's map when it is downloaded.
uk: Файли `png`, `jpg`, `jpeg` та `xml` також можна завантажити на сторінці «Пакети даних» у веб-інтерфейсі. Після завантаження OpenTAKServer автоматично створить для них zip-файли пакетів даних. Якщо зображення має встановлені GPS-координати в даних EXIF, воно автоматично відобразиться на карті EUD після завантаження.

source: Install on Enrollment and Connection
uk: Встановлення під час реєстрації та підключення

source: On the data package page in the web UI there are switches for data package installation on certificate enrollment and on server connection. If the enrollment switch is enabled, the data package will be automatically installed on the EUD upon a successful certificate enrollment. Likewise, if the connection switch is enabled, the data package will be automatically installed the next time the EUD connects. One or both of these options can be enabled for each data package
uk: На сторінці пакета даних у веб-інтерфейсі є перемикачі для встановлення пакета даних під час реєстрації сертифіката та під час підключення до сервера. Якщо перемикач реєстрації ввімкнено, пакет даних буде автоматично встановлено на EUD після успішної реєстрації сертифіката. Аналогічно, якщо перемикач підключення ввімкнено, пакет даних буде автоматично встановлено під час наступного підключення EUD. Для кожного пакета даних можна ввімкнути один або обидва ці параметри

source: ATAK Settings for Installation on Connection
uk: Налаштування ATAK для встановлення під час підключення

source: If an EUD is initially connected to OpenTAKServer via certificate enrollment or a data package, the `Apply TAK Server Profile Updates` option in ATAK will be automatically enabled. Otherwise, you will need to manually enable it. It can be found under Settings->Network Preferences->Network Connection Preferences.
uk: Якщо EUD спочатку підключається до OpenTAKServer через реєстрацію сертифіката або пакет даних, опція `Застосувати оновлення профілю сервера TAK` в ATAK буде автоматично ввімкнена. В іншому випадку вам потрібно буде ввімкнути її вручну. Її можна знайти в розділі Налаштування->Налаштування мережі->Налаштування мережевого підключення.

source: When ATAK connects to a server and this option is enabled, it makes a call to `/Marti/api/device/profile/connection` with an optional `syncSecago` parameter. `syncSecago` is a integer representing the number of seconds since that EUD last connected to the server. If it's present, OpenTAKServer will only send the EUD new or changed data packages between the current time and the last time the EUD connected.
uk: Коли ATAK підключається до сервера, і ця опція увімкнена, він здійснює виклик `/Marti/api/device/profile/connection` з необов'язковим параметром `syncSecago`. `syncSecago` – це ціле число, яке представляє кількість секунд з моменту останнього підключення EUD до сервера. Якщо воно присутнє, OpenTAKServer надсилатиме EUD лише нові або змінені пакети даних між поточним часом і останнім часом підключення EUD.
