Repository: brian7704/OpenTAKServer-docs
Catalog: docs/locales/*/LC_MESSAGES/device_profiles.po
Languages: de

source: Device Profiles
de: Geräteprofile

source: Device profiles allow administrators to automatically push settings out to EUDs. This can help keep settings in all EUDs in sync. Future versions of OpenTAKServer will support assigning different settings to specific users or groups of users.
de: Geräteprofile ermöglichen es Administratoren, Einstellungen automatisch an EUDs zu verteilen. Dadurch können die Einstellungen auf allen EUDs synchron gehalten werden. Zukünftige Versionen von OpenTAKServer werden die Zuweisung unterschiedlicher Einstellungen an bestimmte Benutzer oder Benutzergruppen unterstützen.

source: Usage
de: Auslastung

source: While logged into OpenTAKServer as an administrator, click on `Device Profiles` in the navbar. There will be a list of settings that the administrator has already enabled as well as an `Add Device Profile` button.
de: Während Sie als Administrator bei OpenTAKServer angemeldet sind, klicken Sie in der Navigationsleiste auf `Device Profiles`. Dort finden Sie eine Liste der Einstellungen, die der Administrator bereits aktiviert hat, sowie eine Schaltfläche `Add Device Profile`.

source: In the settings list there are three switches for `Install on Enrollment`, `Install on Connection`, and `Active`.
de: In der Einstellungsliste gibt es drei Schalter für `Installieren bei Registrierung`, `Installieren bei Verbindung` und `Aktiv`.

source: `Install on Enrollment` - Installs the setting on an EUD after a successful [certificate enrollment](certificate_enrollment.md).
de: `Install on Enrollment` - Installiert die Einstellung auf einem EUD nach einer erfolgreichen [Zertifikatregistrierung](certificate_enrollment.md).

source: `Install on Connection` - Installs the setting the next time the EUD connects to the server.
de: `Install on Connection` - Installiert die Einstellung beim nächsten Verbindungsaufbau des EUD zum Server.

source: `Active` - Enables or disables the setting from being installed on EUDs, even if `Install on Enrollment` or `Install on Connection` are enabled.
de: `Aktiv` - Aktiviert oder deaktiviert die Installation der Einstellung auf EUDs, selbst wenn `Bei Registrierung installieren` oder `Bei Verbindung installieren` aktiviert sind.

source: One or both of `Install on Enrollment` and `Install on Connection` may be enabled for each setting.
de: Für jede Einstellung kann entweder die Option `Bei der Registrierung installieren` oder die Option `Bei der Verbindung installieren` aktiviert werden.

source: Settings keys and Values
de: Einstellungsschlüssel und -werte

source: Please refer to [MyTeckNet's Spreadsheet](https://mytecknet.com/creating-tak-data-packages-for-enrollment/#atak-preference-key) for the most complete list of possible settings and their values. Also make sure to set the `Value Type` field is set to the value of the setting's Type field in the MyTeckNeck spreadsheet.
de: Die vollständigste Liste der möglichen Einstellungen und ihrer Werte finden Sie in der [MyTeckNet-Tabelle](https://mytecknet.com/creating-tak-data-packages-for-enrollment/#atak-preference-key). Stellen Sie außerdem sicher, dass das Feld `Werttyp` auf den Wert des Felds „Typ“ der jeweiligen Einstellung in der MyTeckNet-Tabelle gesetzt ist.
