Repository: brian7704/OpenTAKServer-docs
Catalog: docs/locales/*/LC_MESSAGES/feature_comparison.po
Languages: de

source: Feature Comparison
de: Funktionsvergleich

source: Yes
de: Ja

source: Automatic Certificate Authority Generation
de: Automatische Zertifizierungsstellengenerierung

source: No
de: NEIN

source: Certificate Enrollment
de: Zertifikatverteilung

source: No (Coming in 1.7.0)
de: Nein (Erscheint in Version 1.7.0)

source: Data Packages
de: Datenpakete

source: Coming Soon
de: Demnächst verfügbar

source: Installed Separately
de: Separat installiert

source: Video Stream Recording/Playback
de: Videostream-Aufzeichnung/Wiedergabe

source: Mumble Server Authentication
de: Mumble-Server-Authentifizierung

source: Web UI
de: Web-Benutzeroberfläche

source: EUD Authentication
de: EUD-Authentifizierung

source: ADS-B Data From Airplanes.live
de: ADS-B-Daten von Flugzeugen.live

source: AIS Data From AISHub.net
de: AIS-Daten von AISHub.net

source: Database
de: Datenbank

source: SqlAlchemy (Defaults to PostGIS)
de: SQLAlchemy (Standardmäßig PostGIS)

source: SqlAlchemy (Defaults to SQLite)
de: SQLAlchemy (Standardmäßig SQLite)

source: Runs on Raspberry Pi
de: Läuft auf Raspberry Pi

source: Meshtastic support
de: Meshtastic-Unterstützung

source: Device Profiles
de: Geräteprofile

source: Groups/Channels
de: Gruppe/Kanal

source: Actively Developed
de: Aktiv entwickelt
