Repository: brian7704/OpenTAKServer-docs
Catalog: docs/locales/*/LC_MESSAGES/generated_api.po
Languages: de

source: Generated API
de: Generierte API

source: Required by CloudTAK, returns the following
de: Wird von CloudTAK benötigt und gibt Folgendes zurück

source: Health check for Docker, returns the following
de: Health-Check für Docker, gibt Folgendes zurück

source: Server status used on the Dashboard page of the web UI
de: Serverstatus, der auf der Dashboard-Seite der Web-UI verwendet wird

source: dict
de: Wörterbuch

source: Get the details of the currently logged in user
de: Die Details des aktuell angemeldeten Benutzers abrufen

source: User
de: Benutzer

source: Get CoT messages. All parameters are optional.
de: CoT-Nachrichten abrufen. Alle Parameter sind optional.

source: Parameters
de: Parameter

source: The how attribute of the CoT message, i.e. ``m-g``, ``h-g-i-g-o``
de: Das „Wie“-Attribut der CoT-Nachricht, d. h. „`m-g``, „`h-g-i-g-o``

source: The type attribute of the CoT message, i.e. ``a-f-G-U-C``
de: Das Typattribut der CoT-Nachricht, d.h. „a-f-G-U-C“

source: The callsign of the EUD that sent the CoT message
de: Das Rufzeichen des EUD, das die CoT-Nachricht gesendet hat

source: The UID of the EUD that sent the CoT message
de: Die UID des EUD, der die CoT-Nachricht gesendet hat

source: The page number
de: Die Seitenzahl

source: The number of results per page
de: Die Anzahl der Ergebnisse pro Seite

source: Get alerts. All parameters are optional.
de: Benachrichtigungen erhalten. Alle Parameter sind optional.

source: The alert's UID
de: Die UID der Warnung

source: The UID of the EUD that sent the alert
de: Die UID des EUD, der die Warnung gesendet hat

source: The type of alert
de: Die Art der Warnung

source: Query points. All parameters are optional.
de: Abfragepunkte. Alle Parameter sind optional.

source: The point's UID
de: Die UID des Punktes

source: The point's callsign
de: Rufzeichen des Punktes

source: Query EUDS. All parameters are optional.
de: EUDS abfragen. Alle Parameter sind optional.

source: The EUD's callsign
de: Rufzeichen der EUD

source: The username that the EUD belongs to
de: Der Benutzername, zu dem die EUD gehört

source: Downloads the server's truststore with no authentication required.
de: Lädt den Truststore des Servers herunter, ohne dass eine Authentifizierung erforderlich ist.

source: Gets the latest data to be displayed on the web UI's map
de: Ruft die neuesten Daten ab, die auf der Karte der Web-Benutzeroberfläche angezeigt werden sollen

source: Query map icons. All parameters are optional.
de: Kartensymbole abfragen. Alle Parameter sind optional.

source: The iTAK QR string in the following format:
de: Der iTAK-QR-Code hat folgendes Format:

source: Gets a list of group memberships for a user :parameter: username
de: Ruft eine Liste der Gruppenzugehörigkeiten eines Benutzers ab: Parameter: Benutzername

source: return
de: zurückkehren

source: List of group memberships
de: Liste der Gruppenmitgliedschaften

source: Adds a user to one or more groups :parameter: groups - List of groups to add a user to :parameter: username :parameter: direction - Group direction, must be either IN or OUT
de: Fügt einen Benutzer einer oder mehreren Gruppen hinzu: Parameter: Gruppen – Liste der Gruppen, denen ein Benutzer hinzugefügt werden soll; Parameter: Benutzername; Parameter: Richtung – Gruppenrichtung (muss entweder IN oder OUT sein)

source: 400 if LDAP is enabled, no group or username is specified, or if the specified group or user doesn't exist or the user is already in the group. 200 on success.
de: Fehlercode 400, wenn LDAP aktiviert ist, keine Gruppe oder kein Benutzername angegeben wurde oder die angegebene Gruppe oder der Benutzer nicht existiert bzw. der Benutzer bereits Mitglied der Gruppe ist. Fehlercode 200 bei Erfolg.

source: Response
de: Antwort

source: Search groups with filters and pagination
de: Suchgruppen mit Filtern und Paginierung

source: type
de: Typ

source: active
de: aktiv

source: page
de: Seite

source: per_page
de: pro Seite

source: JSON array of groups
de: JSON-Array von Gruppen

source: Get a list of all groups
de: Erhalte eine Liste aller Gruppen

source: Get a list of members of a group
de: Erhalte eine Liste der Mitglieder einer Gruppe

source: JSON array of group members
de: JSON-Array von Gruppenmitgliedern

source: Creates a new group
de: Erstellt eine neue Gruppe

source: 400 if LDAP is enabled, the request is missing the name key or the group exists. 500 on server errors.
de: Fehlercode 400, wenn LDAP aktiviert ist, der Name-Schlüssel in der Anfrage fehlt oder die Gruppe bereits existiert. Fehlercode 500 bei Serverfehlern.

source: Adds a users to a group. This will allow all the user's EUDs to subscribe and unsubscribe from the channels/groups they're allowed to see. :parameter: users - A list of users to add to a group :parameter: group_name - Name of the group to add users to :parameter: direction - Group direction, can only be IN or OUT
de: Fügt einen Benutzer einer Gruppe hinzu. Dadurch können alle Endbenutzer (EUDs) des Benutzers die Kanäle/Gruppen abonnieren und abbestellen, die sie sehen dürfen. :parameter: users – Eine Liste der Benutzer, die einer Gruppe hinzugefügt werden sollen. :parameter: group_name – Name der Gruppe, der Benutzer hinzugefügt werden sollen. :parameter: direction – Gruppenrichtung (nur IN oder OUT)

source: Provides an OAuth token for TAKX and CloudTAK
de: Stellt ein OAuth-Token für TAKX und CloudTAK bereit.

source: Generates a QR string for ATAK certificate enrollment. ATAK certificate enrollment via QR code only works if your server has a Let's Encrypt certificate. Params are sent as JSON.
de: Erzeugt einen QR-Code für die ATAK-Zertifikatregistrierung. Die ATAK-Zertifikatregistrierung per QR-Code funktioniert nur, wenn Ihr Server über ein Let's Encrypt-Zertifikat verfügt. Die Parameter werden im JSON-Format gesendet.

source: The expiration time in unix epoch seconds i.e.1764260510
de: Die Ablaufzeit in Unix-Epochensekunden, d.h. 1764260510

source: Not Before, the token will not be valid until this date in unix epoch seconds.
de: Nicht vor diesem Datum: Das Token ist erst ab diesem Datum in Unix-Epochensekunden gültig.

source: The maximum number of uses for this token.
de: Die maximale Anzahl an Verwendungen für dieses Token.

source: String in the format of tak://com.atakmap.app/enroll?host=server_address.com&username=your_username&token=jwt_token
de: Zeichenkette im Format tak://com.atakmap.app/enroll?host=server_address.com&username=your_username&token=jwt_token

source: Returns an existing ATAK QR string
de: Gibt eine vorhandene ATAK-QR-Zeichenkette zurück

source: Deletes a token
de: Löscht ein Token

source: 200 on success
de: 200 zum Erfolg
