Repository: brian7704/OpenTAKServer-docs
Catalog: docs/locales/*/LC_MESSAGES/index.po
Languages: de

source: Contents:
de: Inhalt:

source: Documentation:
de: Dokumentation:

source: API and Database Models
de: API und Datenbankenmodelle

source: GitHub Release Date
de: GitHub-Veröffentlichungsdatum

source: OpenTAKServer (OTS) is yet another open source TAK Server for ATAK, iTAK, and WinTAK. OTS’s goal is to be easy to install and use, and to run on both servers and SBCs (ie Raspberry Pi).
de: OpenTAKServer (OTS) ist ein weiterer Open-Source-TAK-Server für ATAK, iTAK und WinTAK. Ziel von OTS ist es, einfach zu installieren und zu verwenden zu sein und sowohl auf Servern als auch auf Einplatinencomputern (z. B. Raspberry Pi) zu laufen.

source: This is a new project under active development. Feel free to report any bugs or feature requests to our `GitHub repo <https://github.com/brian7704/OpenTAKServer>`__. You can also join us on our `Discord server <https://discord.gg/6uaVHjtfXN>`__
de: Dies ist ein neues Projekt in aktiver Entwicklung. Meldet uns gerne alle Fehler oder Funktionswünsche in unserem GitHub-Repository <https://github.com/brian7704/OpenTAKServer>__. Ihr könnt uns auch auf unserem Discord-Server <https://discord.gg/6uaVHjtfXN>__ beitreten

source: Current Features
de: Aktuelle Funktionen

source: Support for ATAK 4.8 and up (Older versions may work, needs to be tested)
de: Unterstützung für ATAK 4.8 und höher (Ältere Versionen funktionieren möglicherweise, müssen aber getestet werden)

source: WinTAK support
de: WinTAK-Unterstützung

source: iTAK support
de: iTAK-Unterstützung

source: TAKX support
de: TAKX-Unterstützung

source: `CloudTAK <https://github.com/dfpc-coe/CloudTAK>`__ support
de: `CloudTAK <https://github.com/dfpc-coe/CloudTAK>`__ Unterstützung

source: TCP and SSL CoT streaming
de: TCP- und SSL-CoT-Streaming

source: `Device Profiles <device_profiles.html>`__
de: `Geräteprofile <device_profiles.html>`__

source: Groups/Channels
de: Gruppe/Kanal

source: Authentication
de: Authentifizierung

source: Optional support for user registration with an email account
de: Optionale Unterstützung für die Benutzerregistrierung mit einem E-Mail-Konto

source: Two-factor authentication via TOTP authenticator or email
de: Zwei-Faktor-Authentifizierung per TOTP-Authenticator oder E-Mail

source: Client certificate enrollment
de: Kundenzertifikatsregistrierung

source: Data Sync/Mission API
de: Datensynchronisierungs-/Missions-API

source: CoT routing between EUDs
de: CoT-Routing zwischen EUDs

source: `MediaMTX <https://github.com/bluenviron/mediamtx>`__ integration for video streaming
de: `MediaMTX <https://github.com/bluenviron/mediamtx>`__-Integration für Videostreaming

source: Streams secured via SSL and authentication
de: Streams sind über SSL und Authentifizierung gesichert

source: Stream video from TAK ICU and `OpenTAK ICU <https://github.com/brian7704/OpenTAK_ICU>`__
de: Videostream von der TAK-Intensivstation und `OpenTAK ICU <https://github.com/brian7704/OpenTAK_ICU>`__

source: Stream video from drones
de: Videostream von Drohnen

source: Connect to IP cameras
de: Verbindung zu IP-Kameras herstellen

source: Watch video streams in ATAK’s video tool, web browser, or video player such as VLC
de: Sehen Sie sich Videostreams im Videotool von ATAK, im Webbrowser oder in einem Videoplayer wie VLC an

source: Record streams
de: Streams aufzeichnen

source: Upload data packages to share with other EUDs
de: Datenpakete hochladen, um sie mit anderen Endbenutzern zu teilen

source: Live stream ADS-B and AIS data from the free Airplanes.live and AISHub.net APIs to EUDs
de: Live-Stream von ADS-B- und AIS-Daten über die kostenlosen APIs Airplanes.live und AISHub.net an EUDs

source: Mumble Authentication
de: Mumble-Authentifizierung

source: Use your OpenTAKServer account to log into your Mumble server
de: Verwenden Sie Ihr OpenTAKServer-Konto, um sich bei Ihrem Mumble-Server anzumelden

source: Supported Platforms
de: Unterstützte Plattformen

source: There are installer scripts for Ubuntu, Raspberry Pi in the OpenTAKServer-Installer repo and an official docker image is in the works. Other platforms can be supported as well. The main requirements are Python 3.10 or greater, RabbitMQ, and OpenSSL.
de: Im OpenTAKServer-Installer-Repository befinden sich Installationsskripte für Ubuntu und Raspberry Pi. Ein offizielles Docker-Image ist in Arbeit. Weitere Plattformen werden ebenfalls unterstützt. Die wichtigsten Voraussetzungen sind Python 3.10 oder höher, RabbitMQ und OpenSSL.

source: Planned Features
de: Geplante Funktionen

source: Pull data from networked SDRs (ie dump1090, rtl_ais, rtl_tcp, etc)
de: Daten von vernetzten SDRs abrufen (z. B. dump1090, rtl_ais, rtl_tcp usw.)

source: Supporting The Project
de: Unterstützung des Projekts

source: If you’d like to support this project you can contribute `here <https://buymeacoffee.com/opentakserver>`__. Contributions are voluntary and never required. OpenTAKServer will always remain free and open source.
de: Wenn Sie dieses Projekt unterstützen möchten, können Sie `hier <https://buymeacoffee.com/opentakserver>`__ einen Beitrag leisten. Beiträge sind freiwillig und nicht erforderlich. OpenTAKServer bleibt immer kostenlos und Open Source.
