Repository: brian7704/OpenTAKServer-docs
Catalog: docs/locales/*/LC_MESSAGES/lets_encrypt.po
Languages: de

source: If you have a domain name for your server you can use a Let's Encrypt certificate to secure the web UI. This also allows iTAK to register with the server using a QR code.
de: Wenn du einen Domainnamen für den Server besitzt, könnst du ein Let's Encrypt-Zertifikat verwenden, um die Web-Oberfläche zu sichern. Dies ermöglicht iTAK außerdem die Registrierung beim Server mithilfe eines QR-Codes.

source: Before beginning, make sure your domain has a DNS A record that points to the public IP of your server.
de: Bevor Sie beginnen, stellen Sie sicher, dass Ihre Domain über einen DNS-A-Record verfügt, der auf die öffentliche IP-Adresse Ihres Servers verweist.

source: ATAK and Trusted Certificates
de: ATAK und vertrauenswürdige Zertifikate

source: Please note that ATAK does not use Android's trusted certificate store. It comes bundled with root CAs for Let's Encrypt and Digicert only. Other trusted certificate providers will result in a `TAK Server's Identity Could Not Be Verified` error even though most web browsers and OSes trust them.
de: Bitte beachten Sie, dass ATAK nicht den vertrauenswürdigen Zertifikatsspeicher von Android verwendet. Es enthält ausschließlich Root-Zertifizierungsstellen für Let's Encrypt und Digicert. Die Verwendung anderer vertrauenswürdiger Zertifikatsanbieter führt zu einem Fehler `TAK-Serveridentität konnte nicht verifiziert werden`, obwohl die meisten Webbrowser und Betriebssysteme diesen vertrauen.

source: Ubuntu and Raspberry Pi OS
de: Ubuntu und Raspberry Pi OS

source: Use the following commands to obtain a certificate.
de: Verwenden Sie die folgenden Befehle, um ein Zertifikat zu erhalten.

source: Next change these following two lines in `/etc/nginx/sites-enabled/ots_certificate_enrollment` from this:
de: Ändern Sie als Nächstes die folgenden beiden Zeilen in `/etc/nginx/sites-enabled/ots_certificate_enrollment` wie folgt:

source: to this:
de: dazu:

source: Finally, in `/etc/nginx/sites-enabled/ots_https`, change the same two lines in the server block for port 443. Do not change the certificate settings in the server block for port 8443.
de: Ändern Sie abschließend in `/etc/nginx/sites-enabled/ots_https` die gleichen zwei Zeilen im Serverblock für Port 443. Ändern Sie die Zertifikatseinstellungen im Serverblock für Port 8443 nicht.

source: Once the certificate settings are change, start nginx with this command: `systemctl start nginx`.
de: Sobald die Zertifikatseinstellungen geändert wurden, starten Sie nginx mit diesem Befehl: `systemctl start nginx`.
