Repository: brian7704/OpenTAKServer-docs
Catalog: docs/locales/*/LC_MESSAGES/marti_api.po
Languages: de

source: The following Marti API endpoints are supported by OTS. The full Marti API spec can be found on `TAK.gov <https://docs.tak.gov/api/takserver>`__
de: Die folgenden Marti-API-Endpunkte werden von OTS unterstützt. Die vollständige Marti-API-Spezifikation finden Sie auf TAK.gov <https://docs.tak.gov/api/takserver>

source: Used by the Data Sync plugin to create or change a mission
de: Wird vom Data-Sync-Plugin verwendet, um eine Mission zu erstellen oder zu ändern

source: Used by the Data Sync plugin to get a feed's metadata
de: Wird vom Data-Sync-Plugin verwendet, um die Metadaten eines Feeds abzurufen

source: Used by the Data Sync plugin to delete a feed
de: Wird vom Data-Sync-Plugin verwendet, um einen Feed zu löschen

source: Used by the Data Sync plugin to add a password to a feed
de: Wird vom Data-Sync-Plugin verwendet, um einem Feed ein Passwort hinzuzufügen

source: Used by Data Sync to change EUD mission roles or kick an EUD off of a mission
de: Wird von Data Sync verwendet, um EUD-Missionsrollen zu ändern oder einen EUD aus einer Mission zu entfernen

source: Used by the Data Sync plugin to subscribe to a feed
de: Wird vom Data-Sync-Plugin verwendet, um einen Feed zu abonnieren

source: Used by the Data Sync plugin to unsubscribe to a feed
de: Wird vom Data-Sync-Plugin verwendet, um einen Feed abzubestellen

source: Used by the Data Sync plugin when adding files to a mission Also used to upload files and data packages
de: Wird vom Data-Sync-Plugin beim Hinzufügen von Dateien zu einer Mission verwendet. Wird auch zum Hochladen von Dateien und Datenpaketen verwendet

source: return
de: zurückkehren

source: Associates content/files with a mission
de: Verknüpft Inhalte/Dateien mit einer Mission

source: Used by the Data Sync plugin to get all CoTs associated with a feed. Returns the CoTs encapsulated by an <events> tag
de: Wird vom Data-Sync-Plugin verwendet, um alle einem Feed zugeordneten CoTs abzurufen. Gibt die in einem <events>-Tag gekapselten CoTs zurück
