Repository: brian7704/OpenTAKServer-docs
Catalog: docs/locales/*/LC_MESSAGES/meshtastic.po
Languages: de

source: Meshtastic support is available starting with version 1.2.0.
de: Meshtastic Support ist ab Version 1.2.0 verfügbar.

source: OpenTAKServer supports two-way communication between Meshtastic devices and EUDs connected to OpenTAKServer. This means that Meshtastic devices will show up on the maps of EUDs connected to OpenTAKServer and EUDs will show up on on the Meshtastic app's map. The Meshtastic app can also send and receive messages to All Chat Rooms as well as send and receive DMs from EUDs.
de: OpenTAKServer unterstützt die bidirektionale Kommunikation zwischen Meshtastic-Geräten und EUDs, die mit OpenTAKServer verbunden sind. Das bedeutet, dass Meshtastic-Geräte auf den Karten der mit OpenTAKServer verbundenen EUDs angezeigt werden und EUDs auf der Karte der Meshtastic-App erscheinen. Die Meshtastic-App kann außerdem Nachrichten an alle Chaträume senden und empfangen sowie Direktnachrichten (DMs) von und an EUDs senden und empfangen.

source: Additionally, if a Meshtastic device is attached to a phone running ATAK and the ATAK Meshtastic plugin, GeoChat and PLI messages can be exchanged between EUDs connected to OpenTAKServer and the EUD in the Meshtastic network.
de: Zusätzlich können GeoChat- und PLI-Nachrichten zwischen EUDs, die mit OpenTAKServer verbunden sind, und dem EUD im Meshtastic-Netzwerk ausgetauscht werden, wenn ein Meshtastic-Gerät mit einem Telefon verbunden ist, auf dem ATAK und das ATAK-Meshtastic-Plugin ausgeführt werden.

source: Notes
de: Notizen

source: In order not to overload the Meshtastic network with too many messages, only PLI and GeoChat CoT messages will be published to Meshtastic devices. Data packages and other CoT's such as markers, routes, geofences, etc, will not be sent to the mesh network, even if a Meshtastic device is running ATAK with the ATAK Meshtastic plugin.
de: Um das Meshtastic-Netzwerk nicht mit zu vielen Nachrichten zu überlasten, werden nur PLI- und GeoChat-CoT-Nachrichten an Meshtastic-Geräte gesendet. Datenpakete und andere CoTs wie Marker, Routen, Geofences usw. werden nicht an das Mesh-Netzwerk gesendet, selbst wenn auf einem Meshtastic-Gerät ATAK mit dem ATAK-Meshtastic-Plugin ausgeführt wird.

source: Requirements
de: Anforderungen

source: You will need at least two Meshtastic devices. One will be connected to a Wi-Fi network and act as a gateway while the others will be standard mesh nodes.
de: Sie benötigen mindestens zwei Meshtastic-Geräte. Eines davon wird mit einem WLAN-Netzwerk verbunden und fungiert als Gateway, während die anderen als Standard-Mesh-Knoten fungieren.

source: Configuration
de: Konfiguration

source: There are three configuration settings in `config.yml` for Meshtastic support:
de: Es gibt drei Konfigurationseinstellungen in `config.yml` für die Meshtastic-Unterstützung:

source: `OTS_ENABLE_MESHTASTIC`: Default: `False`
de: `OTS_ENABLE_MESHTASTIC`: Standard: `False`

source: Change to `True` to enable this feature
de: Ändern Sie den Wert auf `True`, um diese Funktion zu aktivieren

source: `OTS_MESHTASTIC_TOPIC`: Default `opentakserver`
de: `OTS_MESHTASTIC_TOPIC`: Standard `opentakserver`

source: This is the MQTT topic that OpenTAKServer will use when publishing messages bound for the Meshtastic network
de: Dies ist das MQTT-Thema, das OpenTAKServer beim Veröffentlichen von Nachrichten für das Meshtastic-Netzwerk verwendet

source: `OTS_MESHTASTIC_PUBLISH_INTERVAL`: Default `30` (seconds)
de: `OTS_MESHTASTIC_PUBLISH_INTERVAL`: Standard `30` (Sekunden)

source: In order not to overload the Meshtastic network with too many messages, PLI CoT's from EUDs connected to OpenTAKServer will only be sent at this interval. This setting has no effect on GeoChat messages
de: Um das Meshtastic-Netzwerk nicht mit zu vielen Nachrichten zu überlasten, werden PLI CoTs von EUDs, die mit dem OpenTAKServer verbunden sind, nur in diesem Intervall gesendet. Diese Einstellung hat keine Auswirkung auf GeoChat-Nachrichten

source: Gateway Node Setup
de: Gateway-Knoten-Einrichtung

source: The gateway node is responsible for exchanging messages between OpenTAKServer and the Meshtastic network. You can have multiple gateway nodes connected to one OpenTAKServer and exchange messages on multiple Meshtastic channels. The gateway node should be set to either the `CLIENT` or `ROUTER_CLIENT` role.
de: Der Gateway-Knoten ist für den Nachrichtenaustausch zwischen OpenTAKServer und dem Meshtastic-Netzwerk zuständig. Mehrere Gateway-Knoten können mit einem OpenTAKServer verbunden sein und Nachrichten über verschiedene Meshtastic-Kanäle austauschen. Der Gateway-Knoten sollte entweder die Rolle `CLIENT` oder `ROUTER_CLIENT` zugewiesen bekommen.

source: Network Connection
de: Netzwerkverbindung

source: The gateway node needs to be connected to a network that can reach your OpenTAKServer. This can be on the same LAN as OpenTAKServer, or it can be at a remote site that can reach your OpenTAKServer via VPN or the internet. Refer to Meshtastic's documentation on how to [enable network connectivity](https://meshtastic.org/docs/configuration/radio/network/).
de: Der Gateway-Knoten muss mit einem Netzwerk verbunden sein, das Ihren OpenTAKServer erreichen kann. Dieser kann sich im selben LAN wie der OpenTAKServer befinden oder an einem entfernten Standort, der über VPN oder das Internet mit Ihrem OpenTAKServer verbunden ist. Informationen zum Aktivieren der Netzwerkverbindung finden Sie in der Dokumentation von Meshtastic [enable network connectivity](https://meshtastic.org/docs/configuration/radio/network/).

source: Once the gateway node is connected to a network you must [enable MQTT](https://meshtastic.org/docs/configuration/module/mqtt/). The settings should be as follows:
de: Sobald der Gateway-Knoten mit einem Netzwerk verbunden ist, müssen Sie MQTT aktivieren [enable MQTT](https://meshtastic.org/docs/configuration/module/mqtt/). Die Einstellungen sollten wie folgt lauten:

source: MQTT: Enabled
de: MQTT: Aktiviert

source: MQTT Server Address: Your server's address
de: MQTT-Serveradresse: Die Adresse Ihres Servers

source: MQTT Username: A valid username from an account on your server
de: MQTT-Benutzername: Ein gültiger Benutzername eines Kontos auf Ihrem Server

source: MQTT Password: The password for the above username
de: MQTT-Passwort: Das Passwort für den oben genannten Benutzernamen

source: Encryption: Disabled (Messages will be encrypted in transit with TLS)
de: Verschlüsselung: Deaktiviert (Nachrichten werden während der Übertragung mit TLS verschlüsselt)

source: TLS: Enabled
de: TLS: Aktiviert

source: Root Topic: Value of the `OTS_MESHTASTIC_TOPIC` setting which defaults to `opentakserver`
de: Root-Thema: Wert der Einstellung `OTS_MESHTASTIC_TOPIC`, der standardmäßig auf `opentakserver` gesetzt ist

source: Proxy to client: Disabled
de: Proxy zum Client: Deaktiviert

source: Map Reporting: Enabled (Optional)
de: Kartenberichterstattung: Aktiviert (optional)

source: Map Report Publish Interval: 86400 (Optional)
de: Veröffentlichungsintervall für Kartenberichte: 86400 (optional)

source: Position Precision: High (Optional)
de: Positionsgenauigkeit: Hoch (optional)

source: Channels
de: Kanäle

source: OpenTAKServer's Web UI now includes a Meshtastic page which can generate channel configurations. In order to send messages from OpenTAKServer to the Meshtastic network, you must add a channel configuration on this UI page with the `downlink` setting enabled. When Meshtastic support is enabled, OpenTAKServer will publish messages to each channel that has the `downlink` option enabled.
de: Die Web-Oberfläche von OpenTAKServer enthält nun eine Meshtastic-Seite, über die Kanalkonfigurationen generiert werden können. Um Nachrichten von OpenTAKServer an das Meshtastic-Netzwerk zu senden, muss auf dieser Seite eine Kanalkonfiguration mit aktivierter Einstellung `downlink` hinzugefügt werden. Bei aktivierter Meshtastic-Unterstützung veröffentlicht OpenTAKServer Nachrichten an jeden Kanal, für den die Option `downlink` aktiviert ist.

source: Once you add a channel configuration in the UI, click the QR code button and use the Meshtastic app to add the channel to your gateway node.
de: Sobald Sie eine Kanalkonfiguration in der Benutzeroberfläche hinzugefügt haben, klicken Sie auf die Schaltfläche „QR-Code“ und verwenden Sie die Meshtastic-App, um den Kanal zu Ihrem Gateway-Knoten hinzuzufügen.

source: !Add Meshtastic Channel Screenshot
de: !Screenshot vom Meshtastic-Kanal hinzufügen
