Repository: brian7704/OpenTAKServer-docs
Catalog: docs/locales/*/LC_MESSAGES/opentak_icu.po
Languages: de

source: The OPUS codec is supported when streaming in RTSP(S), SRT, and Multicast UDP protocols. If you will be viewing the stream in a web browser via WebRTC, use this codec for the best quality.
de: Der OPUS-Codec wird beim Streaming über die Protokolle RTSP(S), SRT und Multicast UDP unterstützt. Wenn Sie den Stream in einem Webbrowser über WebRTC ansehen, verwenden Sie diesen Codec für die beste Qualität.

source: AAC is supported in all streaming protocols. If you will be viewing the stream in a web browser make sure to view it via HLS. HLS supports AAC audio while WebRTC does not.
de: AAC wird in allen Streaming-Protokollen unterstützt. Wenn Sie den Stream in einem Webbrowser ansehen, stellen Sie sicher, dass Sie ihn über HLS abrufen. HLS unterstützt AAC-Audio, während WebRTC dies nicht tut.

source: The G711 codec is locked to a sample rate of 8000hz and mono audio. Both RTSP(S) and RTMP(S) support G711 while SRT does not.
de: Der G711-Codec ist auf eine Abtastrate von 8000 Hz und Mono-Audio festgelegt. RTSP(S) und RTMP(S) unterstützen G711, SRT hingegen nicht.

source: Compatibility Matrix
de: Kompatibilitätsmatrix

source: Yes
de: Ja

source: No
de: NEIN

source: Encryption
de: Verschlüsselung

source: OpenTAK ICU supports encryption when streaming with either RTSPS or RTMPS. This ensures that a 3rd party cannot intercept and view the stream while it's in transit to the server.
de: OpenTAK ICU unterstützt die Verschlüsselung beim Streaming mit RTSPS oder RTMPS. Dadurch wird sichergestellt, dass Dritte den Stream während der Übertragung zum Server nicht abfangen und einsehen können.

source: CA Signed Certificates
de: CA-signierte Zertifikate

source: If your server uses certificates signed by a trusted CA such as Let's Encrypt, simply choose the RTSPS or RTMPS protocol. No further action is required.
de: Wenn Ihr Server Zertifikate verwendet, die von einer vertrauenswürdigen Zertifizierungsstelle wie Let's Encrypt signiert wurden, wählen Sie einfach das RTSPS- oder RTMPS-Protokoll. Es sind keine weiteren Maßnahmen erforderlich.

source: Self-Signed Certificates
de: Selbstsignierte Zertifikate

source: If your server uses self-signed certificates you will need to import them into OpenTAK ICU. The certificates should be in PKCS12 format, the same format that ATAK uses. To import them, use the following steps:
de: Wenn Ihr Server selbstsignierte Zertifikate verwendet, müssen Sie diese in OpenTAK ICU importieren. Die Zertifikate sollten im PKCS12-Format vorliegen, dem gleichen Format, das auch ATAK verwendet. Gehen Sie zum Importieren wie folgt vor:

source: Copy your trust store and user certificates to your device
de: Kopieren Sie Ihren Vertrauensspeicher und Ihre Benutzerzertifikate auf Ihr Gerät

source: Tap the Settings icon in OpenTAK ICU
de: Tippen Sie in OpenTAK ICU auf das Symbol „Einstellungen“

source: Tap Stream Settings
de: Tap-Stream-Einstellungen

source: Tap the `Server uses Self-Signed Certificate` switch
de: Tippen Sie auf den Schalter `Server verwendet selbstsigniertes Zertifikat`

source: Tap `Trust Store Certificate` and locate it
de: Tippen Sie auf `Trust Store Certificate` und suchen Sie es

source: Tap `Trust Store Certificate Password` and enter it. If you're using the same certificates as your TAK server, the password is probably `atakatak`
de: Tippen Sie auf `Trust Store Certificate Password` und geben Sie es ein. Wenn Sie dieselben Zertifikate wie Ihr TAK-Server verwenden, lautet das Passwort wahrscheinlich `atakatak`

source: Tap `Test Certificate`. This step is required and validates that the certificate is a valid PKCS12 certificate and that the password is correct
de: Tippen Sie auf `Zertifikat testen`. Dieser Schritt ist erforderlich und überprüft, ob es sich um ein gültiges PKCS12-Zertifikat handelt und ob das Passwort korrekt ist

source: ![GitHub Release Date](https://img.shields.io/github/release-date/brian7704/OpenTAK_ICU) ![GitHub Release](https://img.shields.io/github/v/release/brian7704/OpenTAK_ICU) [![Hits](https://hits.seeyoufarm.com/api/count/incr/badge.svg?url=https%3A%2F%2Fgithub.com%2Fbrian7704%2FOpenTAK_ICU&count_bg=%2379C83D&title_bg=%23555555&icon=&icon_color=%23E7E7E7&title=hits&edge_flat=false)](https://hits.seeyoufarm.com) ![GitHub Downloads (all assets, all releases)](https://img.shields.io/github/downloads/brian7704/OpenTAK_ICU/total)
de: ![GitHub-Veröffentlichungsdatum](https://img.shields.io/github/release-date/brian7704/OpenTAK_ICU) ![GitHub-Veröffentlichung](https://img.shields.io/github/v/release/brian7704/OpenTAK_ICU) [![Hits](https://hits.seeyoufarm.com/api/count/incr/badge.svg?url=https%3A%2F%2Fgithub.com%2Fbrian7704%2FOpenTAK_ICU&count_bg=%2379C83D&title_bg=%23555555&icon=&icon_color=%23E7E7E7&title=hits&edge_flat=false)](https://hits.seeyoufarm.com) ![GitHub Downloads (all assets, all releases)](https://img.shields.io/github/downloads/brian7704/OpenTAK_ICU/total)

source: GitHub Release Date
de: GitHub-Veröffentlichungsdatum

source: GitHub Release
de: GitHub-Veröffentlichung

source: GitHub Downloads (all assets, all releases)
de: GitHub-Downloads (alle Assets, alle Versionen)

source: OpenTAK ICU is a video streaming app based on [RootEncoder](https://github.com/pedroSG94/RootEncoder) that can stream audio and video to RTSP(S), RTMP(S), and SRT servers such as [MediaMTX](https://github.com/bluenviron/mediamtx). Its primary focus is to work with the TAK ecosystem.
de: OpenTAK ICU ist eine Videostreaming-Anwendung, die auf [RootEncoder](https://github.com/pedroSG94/RootEncoder) basiert und Audio und Video an RTSP(S)-, RTMP(S)- und SRT-Server wie [MediaMTX](https://github.com/bluenviron/mediamtx) streamen kann. Ihr Hauptaugenmerk liegt auf der Integration in das TAK-Ökosystem.

source: Why?
de: Warum?

source: While ATAK already has the TAK ICU plugin, it doesn't seem to support a few features. Specifically it doesn't support streaming audio or using authentication and encryption (RTSPS) at the same time.
de: ATAK verfügt zwar bereits über das TAK ICU-Plugin, dieses scheint jedoch einige Funktionen nicht zu unterstützen. Insbesondere werden weder Audiostreaming noch die gleichzeitige Verwendung von Authentifizierung und Verschlüsselung (RTSPS) unterstützt.

source: Get the APK from this repo's [latest release](https://github.com/brian7704/OpenTAK_ICU/releases/latest)
de: Laden Sie die APK-Datei aus der [neuesten Version](https://github.com/brian7704/OpenTAK_ICU/releases/latest) dieses Repos herunter

source: Streaming protocols
de: Streaming-Protokolle

source: SRT (SRT does not yet support authentication)
de: SRT (SRT unterstützt noch keine Authentifizierung)

source: Authentication
de: Authentifizierung

source: Servers with self-signed certificates
de: Server mit selbstsignierten Zertifikaten

source: Background streaming and recording - Continue streaming and recording audio and video even if the app is minimized or the screen is off.
de: Hintergrund-Streaming und -Aufnahme – Audio- und Video-Streaming und -Aufnahme werden auch dann fortgesetzt, wenn die App minimiert oder der Bildschirm ausgeschaltet ist.

source: Record video to the device while streaming
de: Nehmen Sie während des Streamings Videos auf dem Gerät auf

source: Take photos while recording or streaming
de: Machen Sie Fotos während der Aufnahme oder des Streamings

source: Change between front and back cameras during stream
de: Wechsel zwischen Front- und Rückkamera während des Streams

source: UVC Cameras
de: UVC-Kameras

source: Optional text overlay with GPS location and timestamp
de: Optionale Textüberlagerung mit GPS-Standort und Zeitstempel

source: Support for devices with built-in IR cameras
de: Unterstützung für Geräte mit integrierten IR-Kameras

source: Tested on the Ulefone Armor X13, Armor 22, and Armor 26 Ultra
de: Getestet mit dem Ulefone Armor X13, Armor 22 und Armor 26 Ultra

source: Requires root
de: Erfordert Root-Zugriff

source: Video filters
de: Videofilter

source: Planned features
de: Geplante Funktionen

source: Stream your device's screen instead of camera
de: Streamen Sie den Bildschirm Ihres Geräts anstelle der Kamera

source: Servers
de: Server

source: This app has been developed using [MediaMTX](https://github.com/bluenviron/mediamtx) as the streaming server but any RTSP/RTMP server should work.
de: Diese App wurde unter Verwendung von [MediaMTX](https://github.com/bluenviron/mediaamtx) als Streaming-Server entwickelt, aber jeder RTSP/RTMP-Server sollte funktionieren.

source: Viewing OpenTAK ICU streams from MediaMTX in ATAK
de: Anzeige von OpenTAK ICU-Streams von MediaMTX in ATAK

source: In the video tool, tap the + symbol to add a new stream and use the following settings:
de: Tippen Sie im Videotool auf das Plus-Symbol, um einen neuen Stream hinzuzufügen, und verwenden Sie die folgenden Einstellungen:

source: Type: rtsp
de: Typ: rtsp

source: Address: Your server's IP address or domain name
de: Adresse: Die IP-Adresse oder der Domainname Ihres Servers

source: Port: The defaults are 8554 for RTSP and 8322 for RTSPS
de: Port: Die Standardports sind 8554 für RTSP und 8322 für RTSPS

source: Path: The stream's path that is set in OpenTAK ICU's settings
de: Pfad: Der in den OpenTAK ICU-Einstellungen festgelegte Pfad des Datenstroms

source: Username/Password: Required only if your server enforces authentication
de: Benutzername/Passwort: Nur erforderlich, wenn Ihr Server eine Authentifizierung erzwingt

source: Reliable P2P Connection: Enables a TCP connection and is required if there is a NAT/firewall between your EUD and the server.
de: Zuverlässige P2P-Verbindung: Ermöglicht eine TCP-Verbindung und ist erforderlich, wenn sich zwischen Ihrem Endgerät und dem Server ein NAT/eine Firewall befindet.

source: Viewing the stream in a browser
de: Den Stream im Browser ansehen

source: When using MediaMTX and streaming with H264, you can watch the live stream in a browser by going to
de: Bei Verwendung von MediaMTX und Streaming mit H264 können Sie den Livestream in einem Browser ansehen, indem Sie zu folgender Adresse gehen

source: for an HLS stream or
de: für einen HLS-Stream oder

source: for a WebRTC stream. Note that most browsers don't yet support H265. See [CanIUse](https://caniuse.com/hevc) for details. Also note that WebRTC does not support AAC audio so you will need to use OPUS or G711 if you're viewing the stream via WebRTC.
de: Für einen WebRTC-Stream. Beachten Sie, dass die meisten Browser H.265 noch nicht unterstützen. Weitere Informationen finden Sie unter [CanIUse](https://caniuse.com/hevc). Beachten Sie außerdem, dass WebRTC kein AAC-Audio unterstützt. Sie benötigen daher OPUS oder G.711, wenn Sie den Stream über WebRTC ansehen.

source: Viewing streams in VLC
de: Streams in VLC ansehen

source: Click on Media -> Open Network Stream
de: Klicken Sie auf Medien -> Netzwerkstream öffnen

source: In the URL field enter `rtsp://your_server_address:8554/your_path`
de: Geben Sie im Feld URL `rtsp://Ihre_Serveradresse:8554/Ihr_Pfad` ein

source: Click Play
de: Auf „Abspielen“ klicken

source: When adaptive bitrate is enabled, the video bitrate will change based on your network/internet connection. If the connection can't send packets fast enough, the bitrate will lower. If the connection is good the bitrate will max out at what the bitrate setting's value is.
de: Wenn die adaptive Bitrate aktiviert ist, passt sich die Videobitrate Ihrer Netzwerk-/Internetverbindung an. Ist die Verbindung zu langsam, wird die Bitrate reduziert. Bei einer guten Verbindung wird die Bitrate auf den in der Einstellung festgelegten Maximalwert erhöht.

source: If your server is using self signed certificates and you wish to stream encrypted audio and video, you'll need your server's trust store certificate in PKCS12 (.p12 file extension) format. If your RTSP server is using the same certificates as your TAK server, you can use the same trust store certificate and certificate password in OpenTAK ICU. After selecting the certificate and providing the certificate password, press the Test Certificate button. This simply validates that the certificate is the correct format and that the password is correct.
de: Wenn Ihr Server selbstsignierte Zertifikate verwendet und Sie verschlüsselte Audio- und Videodaten streamen möchten, benötigen Sie das Truststore-Zertifikat Ihres Servers im PKCS12-Format (Dateiendung .p12). Falls Ihr RTSP-Server dieselben Zertifikate wie Ihr TAK-Server verwendet, können Sie dasselbe Truststore-Zertifikat und dasselbe Zertifikatpasswort in OpenTAK ICU verwenden. Nachdem Sie das Zertifikat ausgewählt und das Zertifikatpasswort eingegeben haben, klicken Sie auf die Schaltfläche „Zertifikat testen“. Dadurch wird lediglich überprüft, ob das Zertifikat das korrekte Format aufweist und das Passwort korrekt ist.

source: Feature Comparison
de: Funktionsvergleich

source: Streaming Protocols
de: Streaming-Protokolle

source: Other Features
de: Weitere Funktionen

source: Broadcast CoT on local network
de: CoT wird im lokalen Netzwerk ausgestrahlt

source: Send CoT to TAK server
de: Sende CoT an den TAK-Server

source: Show video on map (KLV)
de: Video auf Karte anzeigen (KLV)

source: View video in ATAK/WinTAK video tool
de: Video im ATAK/WinTAK-Videotool ansehen

source: Stream to Wowza
de: Streamen Sie zu Wowza

source: Stream in background
de: Stream im Hintergrund

source: Take a photo while streaming
de: Mach ein Foto, während du streamst

source: Switch camera while streaming
de: Kamera während des Streamings wechseln

source: Turn on flashlight while streaming
de: Schalte das Licht wärend des Streamings ein

source: Record to device while streaming
de: Aufnahme auf dem Gerät während des Streamings

source: Change Video/Audio bitrate
de: Video-/Audio-Bitrate ändern

source: Change FPS
de: FPS ändern

source: Compass Display
de: Kompassanzeige

source: Server Authentication
de: Serverauthentifizierung

source: Yes (only when using RTSP)
de: Ja (nur bei Verwendung von RTSP)

source: Yes (RTSP(S) and RTMP(S)
de: Ja (RTSP(S) und RTMP(S))

source: UVC Camera Support
de: UVC-Kameraunterstützung

source: Video Filters
de: Videofilter

source: Text Overlay
de: Textüberlagerung

source: IR Cameras
de: IR-Kameras

source: OpenTAK ICU supports devices with built-in IR cameras. It has been tested on the Ulefone Armor X13, Armor 22, and Armor 26 Ultra. If you try a different model, please let us know if it worked or not on the [Discord server](https://discord.gg/6uaVHjtfXN) or by opening an issue on the [GitHub repo](https://github.com/brian7704/OpenTAK_ICU/issues).
de: OpenTAK ICU unterstützt Geräte mit integrierten Infrarotkameras. Es wurde auf dem Ulefone Armor X13, Armor 22 und Armor 26 Ultra getestet. Falls Sie ein anderes Modell ausprobieren, teilen Sie uns bitte auf dem [Discord-Server](https://discord.gg/6uaVHjtfXN) oder durch Erstellen eines Issues im [GitHub-Repository](https://github.com/brian7704/OpenTAK_ICU/issues) mit, ob es funktioniert hat oder nicht.

source: Due to how the IR camera's LEDs are controlled, root is required to enable or disable them. OpenTAK ICU controls them by running the following commands as root.
de: Da die LEDs der IR-Kamera auf bestimmte Weise gesteuert werden, sind Root-Rechte erforderlich, um sie zu aktivieren oder zu deaktivieren. OpenTAK ICU steuert sie durch Ausführen der folgenden Befehle als Root.

source: [MediaMTX](https://github.com/bluenviron/mediamtx) can be used as your self-hosted streaming server. It supports all the streaming protocols, audio codecs, and video codecs that OpenTAK ICU uses. You can also view streams in a web browser via WebRTC or HLS, or in video apps such as VLC via RTSP.
de: [MediaMTX](https://github.com/bluenviron/mediamtx) kann als selbstgehosteter Streaming-Server verwendet werden. Er unterstützt alle Streaming-Protokolle, Audio- und Videocodecs, die auch von OpenTAK ICU genutzt werden. Streams können über WebRTC oder HLS im Webbrowser oder über RTSP in Videoanwendungen wie VLC wiedergegeben werden.

source: Recording
de: Aufnahme

source: OpenTAK ICU supports recording video files to the local device while streaming. Note that for audio, only the AAC codec is supported. If OPUS or G711 codecs are used, the video will record without audio.
de: OpenTAK ICU unterstützt die Aufzeichnung von Videodateien auf dem lokalen Gerät während des Streamings. Beachten Sie, dass für Audio nur der AAC-Codec unterstützt wird. Bei Verwendung der Codecs OPUS oder G711 wird das Video ohne Ton aufgezeichnet.

source: There is also support for recording without streaming. Simply disable the `Stream video` in `Streaming Settings` and enable `Record video to this device` in `Video Settings`. Also make sure that the audio codec is set to AAC.
de: Es besteht auch die Möglichkeit, ohne Streaming aufzunehmen. Deaktivieren Sie dazu einfach die Option `Video streamen` in den `Streaming-Einstellungen` und aktivieren Sie die Option `Video auf diesem Gerät aufnehmen` in den `Video Einstellungen`. Stellen Sie außerdem sicher, dass der Audio-Codec auf AAC eingestellt ist.

source: RTSP is OpenTAK ICU's default protocol and supports both TCP and UDP. If you're using TCP you can optionally enable RTSPS encryption. RTSP over UDP does not support encryption.
de: RTSP ist das Standardprotokoll von OpenTAK ICU und unterstützt sowohl TCP als auch UDP. Bei Verwendung von TCP kann die RTSP-Verschlüsselung optional aktiviert werden. RTSP über UDP unterstützt keine Verschlüsselung.

source: RTMP supports H264, H265, and AV1 video codecs as well as AAC and G711 audio codecs.
de: RTMP unterstützt die Videocodecs H264, H265 und AV1 sowie die Audiocodecs AAC und G711.

source: SRT supports H264 and H265 video codecs, as well as ACC and OPUS audio codecs. It does not support authentication yet.
de: SRT unterstützt die Videocodecs H264 und H265 sowie die Audiocodecs AAC und OPUS. Eine Authentifizierung wird derzeit noch nicht unterstützt.

source: Multicast UDP can be used to stream over your local network virtual network services such as ZeroTier and TailScale. No server is required when using Multicast. When your device has a location fix, OpenTAK ICU will send Multicast CoT messages which will put a sensor icon with its field of view on other EUD's in the same network.
de: Multicast-UDP ermöglicht das Streaming über virtuelle Netzwerkdienste Ihres lokalen Netzwerks wie ZeroTier und TailScale. Für die Verwendung von Multicast ist kein Server erforderlich. Sobald Ihr Gerät eine Standortbestimmung durchgeführt hat, sendet OpenTAK ICU Multicast-CoT-Nachrichten, die anderen Endgeräten im selben Netzwerk ein Sensorsymbol mit dem zugehörigen Sichtfeld anzeigen.

source: Valid Multicast IPs
de: Gültige Multicast-IPs

source: The Multiicast IP range is 224.1.0.0 - 239.255.255.255, however some IPs and IP ranges are reserved and cannot be used. Most IPs in the 232.0.0.0 - 239.255.255.255 range are safe to use. See this [Wikipedia article](https://en.wikipedia.org/wiki/Multicast_address) for more details.
de: Der Multicast-IP-Adressbereich liegt zwischen 224.1.0.0 und 239.255.255.255. Einige IPs und IP-Bereiche sind jedoch reserviert und können nicht verwendet werden. Die meisten IPs im Bereich von 232.0.0.0 bis 239.255.255.255 können bedenkenlos verwendet werden. Weitere Informationen finden Sie in diesem [Wikipedia-Artikel](https://en.wikipedia.org/wiki/Multicast_address).

source: OpenTAK ICU can connect to a TAK server and send Cursor-on-Target messages in XML. This will show a sensor icon on the maps of all EUDs connected to the server. The icon will also show the field of view of the camera. Additionally, OpenTAK ICU will send an HTTP POST request to your server's /Marti/vcm API endpoint. This allows EUDs to download the video stream details in the video tool.
de: OpenTAK ICU kann sich mit einem TAK-Server verbinden und Cursor-on-Target-Nachrichten im XML-Format senden. Dadurch wird auf den Karten aller mit dem Server verbundenen Endgeräte ein Sensorsymbol angezeigt. Das Symbol zeigt außerdem das Sichtfeld der Kamera an. Zusätzlich sendet OpenTAK ICU eine HTTP-POST-Anfrage an den API-Endpunkt /Marti/vcm Ihres Servers. Dies ermöglicht es den Endgeräten, die Videostream-Details im Videotool herunterzuladen.

source: If you're using TCP the only settings that are required are the server address and the port. The port defaults to 8088.
de: Bei Verwendung von TCP sind lediglich die Serveradresse und der Port erforderlich. Der Standardport ist 8088.

source: If your server requires SSL, tap the `Connect to ATAK Server via SSL` switch. You'll then need to specify your trust store and client certificates, along with their passwords. These are the same certificates and passwords you use to connect ATAK to your TAK server. Once specifying both certs, make sure to tap the `Test Certificate` option to validate that the certificates are in the right format and the password is correct.
de: Wenn Ihr Server SSL benötigt, tippen Sie auf den Schalter `Mit ATAK-Server über SSL verbinden`. Anschließend müssen Sie Ihre Truststore- und Clientzertifikate sowie die zugehörigen Passwörter angeben. Dies sind dieselben Zertifikate und Passwörter, die Sie für die Verbindung von ATAK mit Ihrem TAK-Server verwenden. Nachdem Sie beide Zertifikate angegeben haben, tippen Sie auf die Option `Zertifikat testen`, um zu überprüfen, ob die Zertifikate das richtige Format haben und das Passwort korrekt ist.

source: If your TAK server requires authentication, tap the `Enable ATAK Authentication` switch and input your username and password.
de: Falls Ihr TAK-Server eine Authentifizierung erfordert, tippen Sie auf den Schalter `ATAK-Authentifizierung aktivieren` und geben Sie Ihren Benutzernamen und Ihr Passwort ein.

source: TAK Servers Tested
de: TAK-Server getestet

source: OpenTAK ICU has been tested and works with the official [tak.gov](https://tak.gov/) TAK server, [OpenTAKServer](https://github.com/brian7704/OpenTAKServer) and [FreeTAKServer](https://github.com/FreeTAKTeam/FreeTakServer).
de: OpenTAK ICU wurde getestet und funktioniert mit dem offiziellen TAK-Server [tak.gov](https://tak.gov/), [OpenTAKServer](https://github.com/brian7704/OpenTAKServer) und [FreeTAKServer](https://github.com/FreeTAKTeam/FreeTakServer).

source: OpenTAK ICU supports UVC cameras connected via USB such as the [MOHOC 2](https://www.mohoc.com/product/mohoc-2-usb-uvc/). Any UVC cameras, includes cameras supported by HelmCam, should work. If you try a camera please let us know if it worked or not on the [Discord server](https://discord.gg/6uaVHjtfXN) or by opening an issue on the [GitHub repo](https://github.com/brian7704/OpenTAK_ICU/issues).
de: OpenTAK ICU unterstützt UVC-Kameras, die über USB angeschlossen sind, wie z. B. die [MOHOC 2](https://www.mohoc.com/product/mohoc-2-usb-uvc/). Alle UVC-Kameras, einschließlich der von HelmCam unterstützten, sollten funktionieren. Wenn Sie eine Kamera testen, teilen Sie uns bitte auf dem [Discord-Server](https://discord.gg/6uaVHjtfXN) oder durch Erstellen eines Issues im [GitHub-Repository](https://github.com/brian7704/OpenTAK_ICU/issues) mit, ob sie funktioniert hat oder nicht.

source: Usage
de: Auslastung

source: When you connect your camera to your phone via USB, a dialog box will pop up asking if you want to all OpenTAK ICU to use it. When you click yes, OpenTAK ICU will open automatically if it's not already opened.
de: Wenn Sie Ihre Kamera per USB mit Ihrem Smartphone verbinden, erscheint ein Dialogfeld, in dem Sie gefragt werden, ob OpenTAK ICU die Kamera verwenden soll. Wenn Sie auf „Ja“ klicken, öffnet sich OpenTAK ICU automatisch, sofern es noch nicht geöffnet ist.
