Repository: brian7704/OpenTAKServer-docs
Catalog: docs/locales/*/LC_MESSAGES/opentak_icu.po
Languages: de

source: To switch to the UVC camera instead of the device's internal cameras, either tap the settings button (looks like ⚙) → Video Settings → Video Source → UVC camera, or tap the three vertical dots icon (looks like ⋮) → Video Source → UVC Camera.
de: Um von den internen Kameras des Geräts zur UVC-Kamera zu wechseln, tippen Sie entweder auf die Schaltfläche „Einstellungen“ (sieht aus wie ⚙) → Videoeinstellungen → Videoquelle → UVC-Kamera oder tippen Sie auf das Symbol mit den drei vertikalen Punkten (sieht aus wie ⋮) → Videoquelle → UVC-Kamera.

source: When switching to the UVC Camera source, the camera does not have to be connected. If it is not connected you will see a black screen where the video should be. The video will start automatically when the camera is connected. Likewise, the camera can be disconnected and video will restart automatically when it is reconnected.
de: Beim Umschalten auf die UVC-Kameraquelle muss die Kamera nicht angeschlossen sein. Ist sie nicht angeschlossen, wird anstelle des Videobildes ein schwarzer Bildschirm angezeigt. Die Videowiedergabe startet automatisch, sobald die Kamera angeschlossen ist. Ebenso kann die Kamera getrennt werden; die Videowiedergabe wird automatisch neu gestartet, sobald die Kamera wieder angeschlossen wird.

source: Setting Resolution
de: Auflösung einstellen

source: OpenTAK ICU doesn't automatically detect the UVC camera's resolution. To set the resolution manually, tap on settings (looks like ⚙) → Video Settings → UVC Camera Resolution Width and UVC Camera Resolution Height. If those options are greyed out, tap the Video Source option and choose UVC camera. Check your camera's documentation for the best resolution. The default resolution in OpenTAK ICU is 1920x1080.
de: OpenTAK ICU erkennt die Auflösung der UVC-Kamera nicht automatisch. Um die Auflösung manuell einzustellen, tippen Sie auf Einstellungen (⚙) → Videoeinstellungen → UVC-Kamera-Auflösung (Breite) und UVC-Kamera-Auflösung (Höhe). Falls diese Optionen ausgegraut sind, tippen Sie auf Videoquelle und wählen Sie UVC-Kamera. Informationen zur optimalen Auflösung finden Sie in der Dokumentation Ihrer Kamera. Die Standardauflösung in OpenTAK ICU beträgt 1920x1080.

source: Only video is supported from UVC cameras. If your camera has audio capabilities, they will not be used. Instead, audio will come from your device's internal microphone.
de: UVC-Kameras unterstützen ausschließlich Videoaufnahmen. Falls Ihre Kamera über Audiofunktionen verfügt, werden diese nicht genutzt. Der Ton wird stattdessen über das interne Mikrofon Ihres Geräts ausgegeben.

source: Flashlight
de: Licht

source: Your device's built-in flashlight can be enabled when using a UVC camera.
de: Das in Ihrem Gerät integrierte Licht kann bei Verwendung einer UVC-Kamera aktiviert werden.

source: Hardware Encoding
de: Hardware-Codierung

source: OpenTAK ICU uses your device's hardware video encoders. If your device doesn't have an encoder for a particular codec you will have to choose a different one.
de: OpenTAK ICU nutzt die Hardware-Video-Encoder Ihres Geräts. Falls Ihr Gerät keinen Encoder für einen bestimmten Codec besitzt, müssen Sie einen anderen auswählen.

source: H264 is widely supported both in Android devices and web browsers. Use this codec for the best compatibility.
de: H264 wird sowohl von Android-Geräten als auch von Webbrowsern weitgehend unterstützt. Verwenden Sie diesen Codec für optimale Kompatibilität.

source: H265 offers better compression than H264 which means a better quality video with less bandwidth required. However, many web browsers still don't support it. Therefore, it's recommended to use H264 if you plan to view the stream in a browser. But if you will view the stream another way, such as [VLC](https://www.videolan.org/), H265 is preferred.
de: H.265 bietet eine bessere Komprimierung als H.264, was eine höhere Videoqualität bei geringerem Bandbreitenbedarf bedeutet. Viele Webbrowser unterstützen H.265 jedoch noch nicht. Daher empfiehlt sich die Verwendung von H.264, wenn Sie den Stream in einem Browser ansehen möchten. Für andere Wiedergabemethoden, wie beispielsweise [VLC](https://www.videolan.org/), ist H.265 vorzuziehen.

source: AV1 is supported by all streaming protocols. However, most devices do not have a hardware AV1 encoder. At the time of this writing (February 2024), the Google Pixel 8 and Pixel 8 Pro seem to be the only devices with AV1 hardware encoders. But as of Android 14 Google is enforcing AV1 support. This means that if you are on Android 14 or greater you can use AV1 in OpenTAK ICU, but if your device doesn't have a hardware encoder Android will use a software encoder which will probably drain the battery faster. AV1 is not supported when streaming via SRT.
de: AV1 wird von allen Streaming-Protokollen unterstützt. Die meisten Geräte verfügen jedoch nicht über einen Hardware-AV1-Encoder. Zum Zeitpunkt der Veröffentlichung dieses Artikels (Februar 2024) scheinen das Google Pixel 8 und das Pixel 8 Pro die einzigen Geräte mit AV1-Hardware-Encodern zu sein. Ab Android 14 erzwingt Google jedoch die AV1-Unterstützung. Das bedeutet: Wenn Sie Android 14 oder höher verwenden, können Sie AV1 in OpenTAK ICU nutzen. Geräte ohne Hardware-Encoder verwenden hingegen einen Software-Encoder, was den Akkuverbrauch wahrscheinlich erhöht. AV1 wird beim Streaming über SRT nicht unterstützt.

source: OpenTAK ICU supports a number of video filters provided by the [RootEncoder](https://github.com/pedroSG94/RootEncoder) library. These filters can be enabled and disabled while streaming from either the devices front or back cameras, or from a UVC camera.
de: OpenTAK ICU unterstützt verschiedene Videofilter der [RootEncoder](https://github.com/pedroSG94/RootEncoder)-Bibliothek. Diese Filter lassen sich während des Streamings von der Vorder- oder Rückkamera des Geräts oder von einer UVC-Kamera aktivieren und deaktivieren.

source: Text Overlay Filter
de: Textüberlagerungsfilter

source: The text overlay filter will add the stream path, GPS location, and current timestamp to the bottom left corner of the video. There is an option under Settings → Video Settings → Text Overlay Time Zone to switch between UTC and your local time zone.
de: Der Text-Overlay-Filter fügt den Streampfad, die GPS-Position und den aktuellen Zeitstempel in die linke untere Ecke des Videos ein. Unter Einstellungen → Videoeinstellungen → Zeitzone für Text-Overlay können Sie zwischen UTC und Ihrer lokalen Zeitzone umschalten.

source: The chroma key filter will replace a green background with either the default background image or an image of your choice. To set the image, tap on Settings → Video Settings → Chroma Key Background and choose any image on your device. This filter requires a bright green background. You can test it by enabling the filter in OpenTAK ICU and pointing your camera at the green rectangle below. You should see the default background or the image you selected.
de: Der Chroma-Key-Filter ersetzt den grünen Hintergrund entweder durch das Standardhintergrundbild oder ein Bild Ihrer Wahl. Um ein Bild festzulegen, tippen Sie auf „Einstellungen“ → „Videoeinstellungen“ → „Chroma-Key-Hintergrund“ und wählen Sie ein beliebiges Bild von Ihrem Gerät aus. Dieser Filter benötigt einen hellgrünen Hintergrund. Sie können ihn testen, indem Sie ihn in OpenTAK ICU aktivieren und Ihre Kamera auf das grüne Rechteck unten richten. Sie sollten den Standardhintergrund oder das von Ihnen ausgewählte Bild sehen.

source: !Chroma Key Test
de: !Chroma-Schlüsseltest
