Repository: brian7704/OpenTAKServer-docs
Catalog: docs/locales/*/LC_MESSAGES/plugins.po
Languages: de

source: As of version 1.5.0, OpenTAKServer includes a plugin system.
de: Ab Version 1.5.0, verfügt OpenTAKServer über ein Plugin System.

source: Like OpenTAKServer, plugins are made using Python's `Flask <https://flask.palletsprojects.com/en/stable/>`_ framework. Specifically, plugins are `Flask Blueprints <https://flask.palletsprojects.com/en/stable/tutorial/views/>`_.
de: Wie OpenTAKServer werden auch Plugins mit dem Python-Framework `Flask <https://flask.palletsprojects.com/en/stable/>`_ erstellt. Konkret handelt es sich bei Plugins um `Flask Blueprints <https://flask.palletsprojects.com/en/stable/tutorial/views/>`_.

source: Plugins classes must be a subclass of ``opentakserver.plugins.Plugin.Plugin``
de: Plugin Klassen müssen eine Unterklasse von ``opentakserver.plugins.Plugin.Plugin`` sein

source: Plugins can be created by making a new repository from `OTS-Plugin-Template <https://github.com/brian7704/OTS-Plugin-Template>`_. See the screenshot below.
de: Plugins können erstellt werden, indem ein neues Repository aus `OTS-Plugin-Template <https://github.com/brian7704/OTS-Plugin-Template>`_ erstellt wird. Siehe Screenshot unten.

source: Web UI
de: Web-Benutzeroberfläche

source: Plugins can optionally include a web UI that will be displayed in an iframe in OpenTAKServer's UI. Plugin UIs are written in the `Mantine <https://mantine.dev/>`_ react framework. To start a new plugin UI, create a new repo from the `OTS-UI-Plugin-Template <https://github.com/brian7704/OTS-UI-Plugin-Template>`_. The UI repo should be separate from the plugin's repo. See the `SkyFi Plugin's UI <https://github.com/brian7704/OTS-SkyFi-Plugin-UI>`_ for an example.
de: Plugins können optional eine Web-Oberfläche enthalten, die in einem iFrame in der OpenTAKServer-Benutzeroberfläche angezeigt wird. Plugin-Oberflächen werden im React-Framework `Mantine <https://mantine.dev/>`_ geschrieben. Um eine neue Plugin-Oberfläche zu erstellen, legen Sie ein neues Repository aus der Vorlage `OTS-UI-Plugin-Template <https://github.com/brian7704/OTS-UI-Plugin-Template>`_ an. Das Repository der Benutzeroberfläche sollte vom Repository des Plugins getrennt sein. Ein Beispiel finden Sie in der Benutzeroberfläche des `SkyFi-Plugins <https://github.com/brian7704/OTS-SkyFi-Plugin-UI>`_.

source: When building your plugin's UI, it's assumed that your code is in ``~/Webstorm Projects/Your-OTS-Plugin-UI`` and your plugin is at ``~/PyCharm Projects/Your-OTS-Plugin``. The ``npm build`` command will automatically put the built UI files in ``~/PyCharm Projects/Your-OTS-Plugin/ui``. If your code is in another directory, edit the ``outDir`` option in your UI's `vite.config.mjs <https://github.com/brian7704/OTS-UI-Plugin-Template/blob/bf00f38321d24572a85210d40809ec8cc2454893/vite.config.mjs#L13>`_ file
de: Beim Erstellen der Benutzeroberfläche Ihres Plugins wird davon ausgegangen, dass sich Ihr Code in ``~/Webstorm Projects/Your-OTS-Plugin-UI`` und Ihr Plugin in ``~/PyCharm Projects/Your-OTS-Plugin``befindet. Der Befehl ``npm build`` speichert die erstellten UI-Dateien automatisch in ``~/PyCharm Projects/Your-OTS-Plugin/ui``. Befindet sich Ihr Code in einem anderen Verzeichnis, bearbeiten Sie die Option ``outDir`` in der Datei `vite.config.mjs <https://github.com/brian7704/OTS-UI-Plugin-Template/blob/bf00f38321d24572a85210d40809ec8cc2454893/vite.config.mjs#L13>`Ihrer Benutzeroberfläche

source: Licensing
de: Lizenzierung

source: Plugins that are publicly distributed must use the GPLv3 or another `compatible <https://gplv3.fsf.org/wiki/index.php/Compatible_licenses>`_ license.
de: Öffentlich vertriebene Plugins müssen unter der GPLv3 oder einer anderen `kompatiblen <https://gplv3.fsf.org/wiki/index.php/Compatible_licenses>`_Lizenz stehen.

source: Public Repo
de: Öffentliches Repository

source: While plugins can be distributed or kept private as the author chooses (including on PyPI), there is a public plugin repo available. Plugins on this repo will be accepted after a code review to make sure it meets the plugin requirements, works as intended, and doesn't contain any malicious code. Once accepted, OpenTAKServer users will be able to install plugins from this repo from within the web UI. The repo can be browsed at https://repo.opentakserver.io.
de: Plugins können nach Belieben des Autors veröffentlicht oder privat gehalten werden (auch auf PyPI). Es steht jedoch ein öffentliches Plugin-Repository zur Verfügung. Plugins in diesem Repository werden nach einer Code-Überprüfung akzeptiert, um sicherzustellen, dass sie die Plugin-Anforderungen erfüllen, wie vorgesehen funktionieren und keinen Schadcode enthalten. Nach der Akzeptanz können OpenTAKServer-Benutzer Plugins aus diesem Repository über die Web-Oberfläche installieren. Das Repository kann unter https://repo.opentakserver.io eingesehen werden.

source: Development
de: Entwicklung

source: While any IDE can be used for development, this guide will focus on `PyCharm <https://www.jetbrains.com/pycharm/download>`_ for the plugin and `Webstorm <https://www.jetbrains.com/webstorm/>`_ for the UI. Both PyCharm and Webstorm have free versions which can be used.
de: Obwohl jede IDE für die Entwicklung verwendet werden kann, konzentriert sich diese Anleitung auf `PyCharm <https://www.jetbrains.com/pycharm/download>`_ für das Plugin und `Webstorm <https://www.jetbrains.com/webstorm/>`_ für die Benutzeroberfläche. Sowohl PyCharm als auch WebStorm bieten kostenlose Versionen an.

source: `Poetry <https://python-poetry.org/>`_ is used to build, package, and version plugins, as well as manage dependencies.
de: `Poetry <https://python-poetry.org/>`_ wird verwendet, um Plugins zu erstellen, zu verpacken und zu versionieren sowie Abhängigkeiten zu verwalten.

source: Versioning
de: Versionierung

source: `Poetry Dynamic Versioning <https://github.com/mtkennerly/poetry-dynamic-versioning>`_ is used to version plugins based on git tags. When a new version of your plugin is ready to be released, a new git tag should be created with the plugin version using `Semantic Versioning <https://semver.org/>`_. For example, the first version tag could be ``1.0.0``. Then when building the plugin for distribution using the ``poetry build`` command, the sdist and wheel files will be automatically tagged with this version number.
de: `Die dynamische Versionierung von Poetry <https://github.com/mtkennerly/poetry-dynamic-versioning>`_ dient der Versionierung von Plugins anhand von Git-Tags. Sobald eine neue Version Ihres Plugins veröffentlicht werden soll, wird mithilfe der `semantischen Versionierung <https://semver.org/>`_ ein neuer Git-Tag mit der Plugin-Version erstellt. Der erste Versions-Tag könnte beispielsweise ``1.0.0`` lauten. Beim anschließenden Erstellen des Plugins für die Verteilung mit dem Befehl ``poetry build`` werden die sdist- und wheel-Dateien automatisch mit dieser Versionsnummer versehen.

source: Start Developing Your Plugin
de: Beginnen Sie mit der Entwicklung Ihres Plugins

source: The things that need to be changed are marked with ``TODO`` comments in OTS-Plugin-Template and OTS-UI-Plugin-Template.
de: Die zu ändernden Punkte sind in OTS-Plugin-Template und OTS-UI-Plugin-Template mit ``TODO``-Kommentaren gekennzeichnet.

source: Set the name, description, author information, and URLs
de: Name, Beschreibung, Autoreninformationen und URLs festlegen

source: *. The name must start with ``OTS-``
de: *. Der Name muss mit ``OTS-`` beginnen.

source: Change the ``include`` option under ``[tool.poetry]`` to the name of the folder that contains your plugin's code
de: Ändern Sie die Option ``include`` unter ``[tool.poetry]`` in den Namen des Ordners, der den Code Ihres Plugins enthält

source: Do the same for ``tool.poetry-dynamic-versioning.files``
de: Führen Sie das gleiche Verfahren für ``tool.poetry-dynamic-versioning.files`` durch.

source: Change the class name
de: Ändern Sie den Klassennamen

source: Change the name of the blueprint from ``PluginTemplate`` to your plugin's name
de: Ändern Sie den Namen der Vorlage von ``PluginTemplate`` in den Namen Ihres Plugins

source: Add API routes as necessary. Remember to protect your routes using the ``@auth_required`` or ``@roles_accepted`` decorators
de: Fügen Sie bei Bedarf API-Routen hinzu. Denken Sie daran, Ihre Routen mit den Dekoratoren ``@auth_required`` oder ``@roles_accepted`` zu schützen

source: Edit the ``activate()`` method if your plugin needs to run in the background. For example, the AISStream plugin uses the ``activate()`` method to connect to AISStream's servers to pull data.
de: Bearbeiten Sie die ``activate()``-Methode, wenn Ihr Plugin im Hintergrund ausgeführt werden soll. Das AISStream-Plugin verwendet beispielsweise die ``activate()``-Methode, um eine Verbindung zu den AISStream-Servern herzustellen und Daten abzurufen.

source: Rename ``OTS_PLUGIN_TEMPLATE_ENABLED`` to your plugin's name
de: Benennen Sie ``OTS_PLUGIN_TEMPLATE_ENABLED`` in den Namen Ihres Plugins um

source: Add config options as necessary
de: Fügen Sie bei Bedarf Konfigurationsoptionen hinzu

source: Edit the validate() method to validate user input
de: Bearbeiten Sie die Methode `validate()`, um die Benutzereingaben zu validieren
