Repository: brian7704/OpenTAKServer-docs
Catalog: docs/locales/*/LC_MESSAGES/security.po
Languages: de

source: Security
de: Sicherheit

source: For enhanced security, it is recommended that you disable the TCP CoT streaming port and disable nginx from listening for unencrypted HTTP requests on ports 80 and 8080. All data sent and received over these ports is unencrypted. Any third party that intercepts the data will be able to see things such as EUD locations, passwords, geochats, and other data in the clear. To disable the TCP CoT streaming port, simply click the switch in the TCP box of the UI's dashboard, or set the `OTS_ENABLE_TCP_STREAMING_PORT` option to `false` in `config.yml`
de: Zur Erhöhung der Sicherheit wird empfohlen, den TCP-CoT-Streaming-Port zu deaktivieren und nginx so zu konfigurieren, dass es keine unverschlüsselten HTTP-Anfragen auf den Ports 80 und 8080 mehr entgegennimmt. Alle über diese Ports gesendeten und empfangenen Daten sind unverschlüsselt. Jeder Dritte, der diese Daten abfängt, kann Informationen wie EUD-Positionen, Passwörter, Geochats und andere Daten im Klartext einsehen. Um den TCP-CoT-Streaming-Port zu deaktivieren, klicken Sie einfach den Schalter im TCP-Bereich des Dashboards der Benutzeroberfläche oder setzen die Option `OTS_ENABLE_TCP_STREAMING_PORT` option to `false` in `config.yml`

source: Another concern is the Marti API. When TAK clients query the Marti API on port 8080, they do not use any authentication. This means that any third party that can access port 8080 on your server can interact with the Marti API and do things such as upload/download data packages, query video feeds, get a list of EUDs, etc, all without any authentication. When querying the Marti API over HTTPS on port 8443, TAK clients sends a client certificate which the server will verify. These certificates can only be obtained by [certificate enrollment](certificate_enrollment.md) which requires a username and password, or by having an administrator generate a certificate data package and giving it to a user. To stop nginx from listening on ports 80 and 8080, delete `/etc/nginx/sites-enabled/ots_http` and restart nginx by running `sudo systemctl restart nginx`.
de: Ein weiteres Problem stellt die Marti API dar. Wenn TAK-Clients die Marti API über Port 8080 abfragen, wird keinerlei Authentifizierung verwendet. Das bedeutet, dass jeder Dritte, der Zugriff auf Port 8080 Ihres Servers hat, mit der Marti API interagieren kann und beispielsweise Datenpakete hoch- oder herunterladen, Videostreams abfragen, eine Liste von EUDs abrufen usw. kann – alles ohne Authentifizierung. Bei der Abfrage der Marti API über HTTPS auf Port 8443 senden TAK-Clients hingegen ein Client-Zertifikat, das vom Server überprüft wird. Diese Zertifikate können ausschließlich über die [certificate enrollment](certificate_enrollment.md) bezogen werden, die einen Benutzernamen und ein Passwort erfordert, oder indem ein Administrator ein Zertifikats-Datenpaket erstellt und dieses einem Benutzer zur Verfügung stellt. Um zu verhindern, dass nginx auf den Ports 80 und 8080 lauscht, löschen Sie `/etc/nginx/sites-enabled/ots_http` und starten nginx anschließend mit `sudo systemctl restart nginx` neu.

source: Blocking Port Scanning Bots
de: Blockieren von Port-Scanning-Bots

source: The [ipsum](https://github.com/stamparm/ipsum) GitHub repo maintains a list of malicious IP addresses that updates daily. Blocking these IP addresses can be done with the following bash script that is run via a cron job.
de: Das GitHub-Repository [ipsum](https://github.com/stamparm/ipsum) führt eine täglich aktualisierte Liste schädlicher IP-Adressen. Diese IP-Adressen können mit dem folgenden Bash-Skript blockiert werden, das per Cronjob ausgeführt wird.

source: Setting up the ipsum Script
de: Einrichten des ipsum-Skripts

source: Copy and paste the above script to a file somewhere on your server, for example `/opt/ipsum.sh`.
de: Kopieren Sie das obige Skript und fügen Sie es in eine Datei an einem beliebigen Ort auf Ihrem Server ein, zum Beispiel `/opt/ipsum.sh`.

source: Make the script executable `sudo chmod +x /opt/ipsum.sh` (substitute `/opt/ipsum.sh` with the actual location you saved the script to)
de: Machen Sie das Skript ausführbar `sudo chmod +x /opt/ipsum.sh` (ersetzen Sie `/opt/ipsum.sh` durch den tatsächlichen Speicherort, an dem Sie das Skript gespeichert haben)

source: Add a cron job to run every day at midnight
de: Füge einen Cronjob hinzu, der jeden Tag um Mitternacht ausgeführt wird

source: `sudo crontab -e` 2. Add the following line to the bottom of the crontab file `0 0 * * * /opt/ipsum.sh` 3. Save the crontab file. If you're using `nano`, press `ctrl+o` to save, press `enter` to confirm, then `ctrl+x` to exit
de: `sudo crontab -e` 2. Fügen Sie die folgende Zeile am Ende der Crontab-Datei hinzu: `0 0 * * * /opt/ipsum.sh` 3. Speichern Sie die Crontab-Datei. Wenn Sie `nano` verwenden, drücken Sie `ctrl+o` zum Speichern, `enter` zum Bestätigen und anschließend `ctrl+x` zum Beenden

source: IPTables Rules
de: IPTables-Regeln

source: The following IPTables ruleset opens all ports used by OpenTAKServer and blocks all others. It also includes the ipsum ruleset. You can add or remove rules from this list as needed. After saving the rules to a file, you can load them with this command `iptables-restore < /path/to/iptables.rules`
de: Das folgende IPTables-Regelset öffnet alle von OpenTAKServer verwendeten Ports und blockiert alle anderen. Es enthält auch das ipsum-Regelset. Sie können dieser Liste nach Bedarf Regeln hinzufügen oder entfernen. Nachdem Sie die Regeln in einer Datei gespeichert haben, können Sie sie mit diesem Befehl laden: `iptables-restore < /Pfad/zu/iptables.rules`

source: Which rules to enable depends on which components you're using. The list of all services is available in [Architecture](architecture.md). At a minimum, you'll need to open 8443, 443, 8089, and 8446 for TAK to work, and 8080, 80, and 8088 if you're using TCP.
de: Welche Regeln aktiviert werden müssen, hängt von den verwendeten Komponenten ab. Die Liste aller Dienste finden Sie in der Datei [Architecture](architecture.md). Für die Funktion von TAK müssen mindestens die Ports 8443, 443, 8089 und 8446 geöffnet sein, bei Verwendung von TCP zusätzlich die Ports 8080, 80 und 8088.

source: Once the rules are loaded, install the `iptables-persistent` package in Ubuntu to re-apply them after every reboot.
de: Sobald die Regeln geladen sind, installieren Sie das Paket `iptables-persistent` unter Ubuntu, um sie nach jedem Neustart erneut anzuwenden.
