Repository: brian7704/OpenTAKServer-docs
Catalog: docs/locales/*/LC_MESSAGES/update_server.po
Languages: de

source: OpenTAKServer supports ATAK's plugin update system. An administrator of an OTS server can upload plugin APKs which will be automatically pushed out to EUDs when ATAK is opened.
de: OpenTAKServer unterstützt das Plugin-Update-System von ATAK. Ein Administrator eines OTS-Servers kann Plugin-APKs hochladen, die automatisch an EUDs verteilt werden, sobald ATAK geöffnet wird.

source: Obtaining Plugins
de: Plugins beziehen

source: OpenTAKServer does not come with any plugins. Official plugins are available at [TAK.gov](https://tak.gov) and some open source plugins are available on GitHub. You must obtain them and upload them to your OpenTAKServer manually.
de: OpenTAKServer wird ohne Plugins ausgeliefert. Offizielle Plugins sind unter [TAK.gov](https://tak.gov) verfügbar, und einige Open-Source-Plugins sind auf GitHub zu finden. Sie müssen diese selbst beschaffen und manuell auf Ihren OpenTAKServer hochladen.

source: Uploading Plugins
de: Plugins hochladen

source: While logged in as an administrator, browse to the Plugin Updates page in the navbar. Here you will see the list of plugins that are currently available for EUDs to download. Click the Upload Plugin button to upload a plugin APK. The only required field is the Plugin File field. OpenTAKServer will automatically the extract required metadata (i.e. revision code, plugin name, minimum required Android and ATAK versions, etc.), as well as automatically generate the required `product.infz` file.
de: Melden Sie sich als Administrator an und navigieren Sie in der Navigationsleiste zur Seite „Plugin-Updates“. Dort finden Sie die Liste der aktuell für Endbenutzer verfügbaren Plugins. Klicken Sie auf „Plugin hochladen“, um eine Plugin-APK-Datei hochzuladen. Das einzige Pflichtfeld ist das Feld „Plugin-Datei“. OpenTAKServer extrahiert automatisch die benötigten Metadaten (z. B. Revisionscode, Plugin-Name, Mindestversionen von Android und ATAK usw.) und generiert automatisch die erforderliche Datei `product.infz`.

source: OpenTAKServer will also attempt to extract the plugin's icon from the APK. However, it will only succeed if the plugin's icon is in PNG format, not in Android vector xml format. Because of this, you can optionally specify a separate icon file in the upload form. The icon should be a PNG file.
de: OpenTAKServer versucht außerdem, das Plugin-Symbol aus der APK-Datei zu extrahieren. Dies gelingt jedoch nur, wenn das Symbol im PNG-Format vorliegt, nicht im Android-Vektor-XML-Format. Daher können Sie optional im Upload-Formular eine separate Symboldatei angeben. Das Symbol muss im PNG-Format vorliegen.

source: Plugin Versions
de: Plugin-Versionen

source: Starting in version 1.6.0, OpenTAKServer supports uploading plugins for different versions of ATAK. This is to support a feature introduced in ATAK 5.5 where ATAK will request a list of plugins for its version. ATAK 5.4 and prior will still query for a list of all plugins.
de: Ab Version 1.6.0 unterstützt OpenTAKServer das Hochladen von Plugins für verschiedene ATAK-Versionen. Dies dient der Unterstützung einer in ATAK 5.5 eingeführten Funktion, bei der ATAK eine Liste der für die jeweilige Version benötigten Plugins anfordert. ATAK 5.4 und ältere Versionen fragen weiterhin eine Liste aller Plugins ab.

source: !Plugin Updates Screenshot
de: Screenshot der Plugin-Updates

source: ATAK Settings
de: ATAK-Einstellungen

source: When connecting an EUD to OpenTAKServer the first time, it is recommended to use [Certificate Enrollment](certificate_enrollment.md) or a data package generated in OpenTAKServer's UI. These connection methods will automatically enable ATAK's plugin update feature.
de: Bei der erstmaligen Verbindung eines Endgeräts mit OpenTAKServer wird die Verwendung der [Zertifikatregistrierung](certificate_enrollment.md) oder eines in der OpenTAKServer-Benutzeroberfläche generierten Datenpakets empfohlen. Diese Verbindungsmethoden aktivieren automatisch die Plugin-Update-Funktion von ATAK.

source: For manual setup, follow these steps:
de: Für die manuelle Einrichtung befolgen Sie diese Schritte:

source: Click ATAK's hamburger icon (three horizontal lines in the top left corner)
de: Klicken Sie auf das Hamburger-Symbol von ATAK (drei horizontale Linien in der oberen linken Ecke)

source: Select the Plugin tool
de: Wählen Sie das Plugin-Werkzeug aus

source: Select the gear icon at the bottom of the screen
de: Wählen Sie das Zahnradsymbol am unteren Bildschirmrand aus

source: Enable `Plugin Loading`, `Auto Sync`, and `Update Server`
de: Aktivieren Sie `Plugin Loading`, `Auto Sync` und `Update Server`

source: For `Update Server URL` enter `https://<YOUR_SERVER_ADDRESS>:8443/api/packages`
de: Für `Update Server URL` geben Sie `https://<IHRE_SERVER_ADRESSE>:8443/api/packages` ein

source: For `Update Server SSL/TLS Truststore Location`, select your OpenTAKServer's `truststore-root.p12` on your device
de: Wählen Sie für `Update Server SSL/TLS Truststore Location` die Datei `truststore-root.p12` Ihres OpenTAKServers auf Ihrem Gerät aus

source: You can get a copy of your server's `truststore-root.p12` file by browsing to `https://<YOUR_SERVER_ADDRESS>/api/truststore`
de: Sie können eine Kopie der Datei `truststore-root.p12` Ihres Servers erhalten, indem Sie zu `https://<YOUR_SERVER_ADDRESS>/api/truststore` navigieren

source: For `Update Server SSL/TLS Truststore Password`, enter your truststore's password. The default is `atakatak`
de: Geben Sie unter `Update Server SSL/TLS Truststore Password` das Passwort Ihres Truststores ein. Der Standardwert ist `atakatak`
