Repository: brian7704/OpenTAKServer-docs
Catalog: docs/locales/*/LC_MESSAGES/video_streaming.po
Languages: uk

source: Video Streaming
uk: Потокове відео

source: OpenTAKServer uses [MediaMTX](https://github.com/bluenviron/mediamtx) for video streaming and recording. It accepts streams from apps such as [OpenTAK ICU](https://github.com/brian7704/OpenTAK_ICU) and TAK ICU, as well as devices like drones and IP Cameras.
uk: OpenTAKServer використовує [MediaMTX](https://github.com/bluenviron/mediamtx) для потокової передачі та запису відео. Він приймає потоки з таких програм, як [OpenTAK ICU](https://github.com/brian7704/OpenTAK_ICU) та TAK ICU, а також з таких пристроїв, як дрони та IP-камери.

source: Streaming From Your Browser
uk: Потокове передавання з вашого браузера

source: OpenTAKServer supports streaming from any device that has a browser and a camera. On the Video Streams page of OpenTAKServer's web UI there is a button labeled `Start Streaming`. Clicking that button will prompt the browser to ask for permission to use your device's camera and microphone to stream audio and video to MediaMTX. This is helpful in situations where someone with an Android or iOS device would like to stream to other users on the server but they have no app to do so. Laptop and desktop computers can also use this button to stream from their cameras.
uk: OpenTAKServer підтримує потокову передачу з будь-якого пристрою, на якому є браузер і камеру. На сторінці «Відеопотоки» веб-інтерфейсу OpenTAKServer є кнопка з написом ` «Почати потокову передачу» `. Натискання цієї кнопки запропонує браузеру запитати дозвіл на використання камери та мікрофона вашого пристрою для потокової передачі аудіо та відео на MediaMTX. Це корисно в ситуаціях, коли хтось із пристроєм Android або iOS хоче транслювати відео іншим користувачам на сервері, але у нього немає програми для цього. Ноутбуки та настільні комп’ютери також можуть використовувати цю кнопку для потокової передачі зі своїх камер.

source: Note that streaming in this way only streams audio and video. Users can view the stream on their EUDs, but no location information is included with the stream, meaning there will be no icon on OpenTAKServer's or any EUD's maps for the location of the stream.
uk: Зверніть увагу, що потокове передавання таким чином передає лише аудіо та відео. Користувачі можуть переглядати потокове передавання на своїх EUD, але інформація про місцезнаходження не додається до потокового передавання, тобто на картах OpenTAKServer або будь-яких EUD не буде значка для місцезнаходження потокового передавання.

source: Streaming Protocols
uk: Протоколи потокової передачі

source: You can stream to MediaMTX using a variety of protocols:
uk: Ви можете транслювати на MediaMTX, використовуючи різні протоколи:

source: SRT
uk: СТО

source: HLS
uk: ЗСЖ

source: UDP Multicast
uk: Багатоадресна розсилка UDP

source: Watching Video Streams
uk: Перегляд відеопотоків

source: In Browser
uk: У браузері

source: In OpenTAKServer, click on `Video Streams`. In the list of streams, click the `Watch` button on the stream you want to view. A video player will show up below the list of streams. There is a known issue where the player sometimes doesn't show up. If that happens, refresh the page and try again.
uk: У OpenTAKServer натисніть на `Відеопотоки`. У списку потоків натисніть кнопку `Дивитися` на потоці, який ви хочете переглянути. Під списком потоків з’явиться відеоплеєр. Існує відома проблема, через яку плеєр іноді не відображається. Якщо це станеться, оновіть сторінку та спробуйте ще раз.

source: Alternatively, you can copy the WebRTC link of the video and paste it in a new tab.
uk: Або ж ви можете скопіювати посилання WebRTC на відео та вставити його в нову вкладку.

source: In ATAK
uk: В ATAK

source: When ATAK is connected to OpenTAKServer, open the Video tool, then tap the download button. ATAK will query the server for a list of video streams. Choose which stream to view and tap the `Ok` button. Next, edit the video settings and add your OpenTAKServer username and password. You can now view the video stream.
uk: Коли ATAK підключено до OpenTAKServer, відкрийте інструмент «Відео», а потім натисніть кнопку завантаження. ATAK запитає у сервера список відеопотоків. Виберіть, який потік переглядати, і натисніть кнопку `ОК`. Далі відредагуйте налаштування відео та додайте своє ім’я користувача та пароль OpenTAKServer. Тепер ви можете переглядати відеопотік.

source: In Kodi
uk: У Коді

source: There is an add-on for [Kodi](https://kodi.tv/) that allows you to watch streams and recordings from your server. The add-on works on all platforms that Kodi works on (Windows, macOS, Linux, Android, iOS, etc). To in stall the add-on, browse to Add-ons -> Download -> Video add-ons -> OpenTAKServer Video Plugin and select the install button.
uk: Існує доповнення для [Kodi](https://kodi.tv/), яке дозволяє переглядати трансляції та записи з вашого сервера. Доповнення працює на всіх платформах, на яких працює Kodi (Windows, macOS, Linux, Android, iOS тощо). Щоб встановити доповнення, перейдіть до розділу Доповнення -> Завантажити -> Відеодоповнення -> Відеоплагін OpenTAKServer і натисніть кнопку встановлення.

source: The first time the add-on is started, it will take you to the settings screen where you will need to enter your server's address, username, and password.
uk: Під час першого запуску доповнення ви потрапите на екран налаштувань, де вам потрібно буде ввести адресу вашого сервера, ім'я користувача та пароль.

source: ![Kodi Add-on](images/kodi_screenshot_1.png)
uk: ![Доповнення Kodi](images/kodi_screenshot_1.png)

source: Kodi Add-on
uk: Додаток Kodi

source: In VLC
uk: У VLC

source: Copy the RTSP link from OpenTAKServer. In VLC, click Media -> Open Network Stream. Paste the RTSP link and click the Play button. You will be prompted for your OpenTAKServer username and password. Enter them and click Ok.
uk: Скопіюйте посилання RTSP з OpenTAKServer. У VLC натисніть Media -> Open Network Stream. Вставте посилання RTSP і натисніть кнопку Play. Вам буде запропоновано ввести ім'я користувача та пароль OpenTAKServer. Введіть їх і натисніть OK.

source: Recording Streams
uk: Запис потоків

source: To record a stream, simply click on the stream's record switch. You can do this during a stream or while not streaming. Recording automatically starts when a stream goes live and stops one the stream stops. Recorded videos will be in `~/ots/mediamtx/recordings/<path_name>` by default. You can watch and download recording by clicking `Video Recordings` in the navigation bar.
uk: Щоб записати трансляцію, просто натисніть на перемикач запису трансляції. Ви можете зробити це під час трансляції або коли трансляція не відбувається. Запис автоматично починається, коли трансляція починається в прямому ефірі, і зупиняється, коли трансляція зупиняється. Записані відео за замовчуванням зберігатимуться в `~/ots/mediamtx/recordings/<шлях_до_трансляції>`. Ви можете переглянути та завантажити запис, натиснувши `Відеозаписи` на панелі навігації.

source: Screenshot
uk: Знімок екрана

source: ![!Video Streams](images/video_streams.png)
uk: ![!Відеопотоки](images/video_streams.png)
